[
    {
        "Title": "Brown Lentils (Whole Masoor Dal)",
        "Ingredients": "▢ 1 cup brown lentils (whole masoor dal)▢ ½ cup red lentils (optional, skinned masoor dal, read notes)▢ 4 cups water  (more if needed, 3¼ for pressure cooker, read notes)▢ 3 tablespoons oil/ghee▢ 1 teaspoon cumin seeds (+ 1 teaspoon fennel seeds, optional)▢ 3  dried red chilies  (deseeded or chili flakes to add later)▢ 1 cup (1 medium) onion fine chopped▢ 1 tablespoon ginger  minced▢ 1 tablespoon garlic minced▢ 1½ cup (2 medium) tomato  (fine chopped, peeled & deseeded if required)▢ 4 tablespoons coriander leaves  with tender stalks chopped (reserve some leaves to garnish)▢ ¼ teaspoon organic turmeric▢ 1 teaspoon Kashmiri red chili powder (adjust to taste, more if you want)▢ 1  teaspoon sea salt (more to adjust)▢ 1 tablespoon dried fenugreek leaves (Kasuri methi)▢ 1 tablespoon amchur  (dried mango powder or lemon juice, read notes)▢ 1 teaspoon garam masala  (more if you want, adjust to taste)▢ 1 teaspoon coriander powder + ½ teaspoon cumin powder (both optional)",
        "Instructions": "▢ Rinse lentils in a large pot and pour water. Bring to a rolling boil on a high heat and reduce to medium. Cook until tender, 20 to 25 mins. We are looking for the red lentils to break down completely and the brown lentils to remain in shape., ▢ While the lentils cook, chop and begin to make the onion tomato masala.▢ On a medium flame, heat ghee in a large pan. Add cumin and fennel seeds, followed by dried red chilies.▢ Once the seeds begin to sizzle and chilies turn crisp (not burnt), add onions and saute until light golden. Stir in ginger garlic and coriander stems. Saute till aromatic for 1 to 2 mins.▢ Stir in turmeric, salt, chili powder, coriander powder, cumin powder (optional) and garam masala, followed by tomatoes. Add ¼ cup water and cook until the tomatoes break down completely.▢ Add the lentils along with the liquid in the pot and mix well. Pour hot water as needed (about ½ cup) and bring to a boil. Simmer for 5 minutes until thick and traces of fats visible on top. (Check photo in the post)▢ Optionally mash the lentils a bit, for a thicker & creamy consistency. Stir in amchur & fenugreek . Taste test and more salt, chili flakes or garam masala as needed. ▢ Serve brown lentils, with a garnish of coriander leaves. Squeeze some lemon juice if you want. Serve it with a side of cucumber salad, quinoa or rice., ▢ Follow all the above steps on a saute mode. Pressure cook for 10 mins and let the pressure drop naturally. Open the lid and mix. If it is too thick, pour little hot water and saute for 1 to 2 mins. Stir in amchur and fenugreek."
    },
    {
        "Title": "Saag Aloo",
        "Ingredients": "▢ 250 grams (½ lb)  potatoes  (2 medium aloo, peel, dice to 1 * ¾ inch)▢ 150 grams (5 ounces) baby spinach  (4 cups, or a mix of spinach with microgreens or kale/ fenugreek/mustard greens)▢ ½ cup (1 small)  onion  (fine chopped)▢ ⅓ cup (1 medium) tomatoes (deseeded & fine chopped or pureed)▢ 1 to 2 green chilies  ( chopped or slit, Thai/ Indian or Serrano Peppers, omit for kids)▢ 1 teaspoon (½ inch)  ginger  (peeled and minced)▢ 1 teaspoon (2 )  medium garlic  cloves minced▢ ¼ to ½ teaspoon Kashmiri red chili powder  (or black pepper, adjust to taste)▢ ⅛ teaspoon turmeric▢ ½ teaspoon Garam masala  (adjust to taste)▢ ½ teaspoon coriander powder▢ ¼ teaspoon cumin powder▢ ⅓ to ½ teaspoon sea salt  (adjust to taste)▢ ½ teaspoon cumin seeds  (optional)▢ 2  tablespoons oil or ghee▢ ½ tablespoon kasuri methi  (dried fenugreek leaves, optional)▢ ½ cup water (more if required)▢ 2 tablespoons coriander leaves or microgreens chopped▢ 1 to 2 tablespoon lemon juice  (to serve)",
        "Instructions": "▢ Rinse your greens in plenty of water and drain them to a colander. Shake off to drain the water completely.  Keep aside to use later. Prepare the other ingredients.▢ Heat oil/ghee in a wide pan. Add cumin seeds. When the seeds begin to sizzle add onions and saute for 4 to 5 minutes. ▢ Add potatoes, ginger, garlic and green chilies. Saute for another 1 minute. Stir in salt, chili powder, turmeric, coriander powder, cumin powder and garam masala.▢ Pour water and cook covered until the potatoes are al dente, not fully cooked or mushy. If required add more water as they cook. Taste test and add more salt or spices to taste. ▢ Add tomatoes and cook on a medium high heat until they lose the raw flavor. Avoid over stirring here.▢ Optional – Add fenugreek leaves/kale/mustard greens if using and stir fry until they wilt.▢ Add spinach in batches and saute until wilted. Add crushed kasuri methi, microgreens if using and turn off.  Mix well to wilt the microgreens.▢ Let cool down a bit and squeeze in lemon juice and garnish with coriander leaves/ microgreens if you want."
    },
    {
        "Title": "Methi Matar Malai",
        "Ingredients": "▢ 1 tablespoon oil▢ ½ teaspoon cumin seeds▢ 2 small (or 1 large) green cardamoms▢ ⅛ to ¼ teaspoon black pepper corn (cut down for low heat)▢ ¾ inch cinnamon piece (optional, or ½ inch cassia)▢ 2 cloves (optional)▢ ⅓ inch (5 grams) ginger  sliced ▢ 2 (5 grams) large garlic cloves  sliced ▢ 1 green chili  (chopped to 2 portions, omit for kids)▢ 1 cup (125 grams) yellow onion sliced▢ 15 (30 grams) cashews▢ ½ cup (120 ml) water to cook onions, ▢ 1 tablespoon butter▢ 2 to 2½ cups (50 grams)  methi leaves  (weigh/measure, rinse & chop)▢ ½ cup (90 grams) green peas  (heaped cup, frozen or boiled fresh peas)▢ ⅓  teaspoon sea salt (+ more, adjust to taste)▢ ½ teaspoon coriander powder▢ ¼ teaspoon fennel powder  (optional)▢ ⅓ to ½ teaspoon Garam masala  (or use as per your preference)▢ ⅓ to ½ cup water (or use milk to omit cream, read notes)▢ 2 to 3 tablespoons heavy cream  (read notes to omit, use more if you want)",
        "Instructions": "▢ Heat oil in a pan and add the whole spices – cumin, cinnamon, cardamom, black pepper and cloves. (be careful as they can splutter)▢ When they begin to sizzle, add green chilies, ginger, garlic & onions. Saute them for 6 mins until transparent. Add cashews and pour water. Cook covered until very soft, for 5 to 6 mins.▢ Cool down and remove the chilies (for kids-friendly/ low heat option). Transfer to a blender jar and blend to a super smooth puree., ▢ Meanwhile, on a medium heat, melt butter in the same pan and add methi leaves. Saute for 4 to 5 mins until wilted. ▢ Stir in the garam masala, fennel, salt and coriander powder. Add the green peas and saute for 2 mins.▢ Transfer the onion cashew puree and pour water. Mix well and bring it to a gentle boil. Cook covered on a medium heat for 5 mins, until thick.▢ Taste test and adjust salt, pepper or add back the green chilies for extra heat. Stir in heavy cream or fresh cream and turn off. Serve with Tandoori Roti, Naan, Roti or with Basmati rice."
    },
    {
        "Title": "Red Lentil Curry",
        "Ingredients": "▢ 1 cup (200 grams) red lentils  (split or whole)▢ 2½ cups water  (more if needed, same for IP)▢ 2 to 3 tablespoons oil / ghee or butter▢ 1 sprig  curry leaves  or bay leaf▢ 3 inch cinnamon piece + ½ tsp cumin seeds (omit if you don't have)▢ ¾ to 1 cup (1 medium) onions fine chopped▢ ¾ tablespoon (3 medium) garlic cloves grated/pressed ▢ ¾ tablespoon (½ inch slice) ginger  grated/crushed ▢ 1 green chili  (optional, chopped or slit, serrano peppers/ Thai/ Indian green chilies)▢ 1¾ cups (3 medium) Tomatoes  (peeled & chopped/pureed or 14 oz. can crushed tomatoes)▢ 1 teaspoon salt  (more to adjust, cut down if your curry powder has salt)▢ ½ teaspoon Kashmiri chili powder / paprika (adjust to taste)▢ 1 tablespoon curry powder  (mild – or  2 tsp coriander powder, ¾ tsp cumin pow, ¼ tsp each turmeric, chili pow, cardamom, fennel, black pepper )▢ ¾ to 1 teaspoon garam masala  (adjust to taste)▢ 2 teaspoons kasuri methi (dried fenugreek leaves)▢ ⅓  cup heavy cream / yogurt/ cashew cream (20 cashews blend with ⅓ cup water)▢ 2 to 3 tablespoons chopped coriander leaves  to garnish",
        "Instructions": "▢ Add red lentils to a pot and rinse them thrice. Drain and pour water. Bring to a rolling boil on a high heat and reduce to medium.▢ Let cook until tender (al dente), for 10 mins. If you want you may skim the froth. Older lentils take longer to cook. While the lentils cook, chop and prepare the other ingredients.▢ Heat oil/ghee in a medium pan. Add the whole spices, onions, green chilies and curry leaves. Saute until golden, for about 8 mins.▢ Stir in ginger garlic and saute for a minute, until aromatic.▢ Stir in the curry powder, garam masala and Kashmiri chili powder, followed by tomatoes & (a splash of water if using fresh tomatoes). Cover and cook until the tomatoes break down.▢ Saute for 1 to 2 mins until the mixture turns aromatic.▢ Add the red lentils along with the leftover stock/ water. Mix well and more water as needed. You will need about ½ cup. Bring it to a boil and simmer for 2 to 3 minutes.▢ If you want mash some of the lentils with the back of the spoon. Stir in kasuri methi and cream. Simmer for 2 minutes. ▢ Taste test. If you want, add more salt, garam masala or black pepper for heat.▢ Garnish with coriander leaves and squeeze some lemon juice.▢ Serve red lentil curry over rice or with Naan, Chapati, Roti or any other flatbreads., ▢ You don't need to cook the lentils separately. Make the masala first, add the lentils and pressure cook for 7 minutes. Wait for natural pressure release and add kasuri methi and cream., ▢ You don't need to cook the lentils separately. Make the masala first, add the lentils to the cooker.  Pressure cook for 2 to 3 whistles on a medium heat. Wait for the pressure to drop and add kasuri methi and cream. If you want make a extra tadka."
    },
    {
        "Title": "Paneer Butter Masala Recipe",
        "Ingredients": "▢ 1 tablespoon oil▢ 2 green cardamoms (or ¼ to ⅓ tsp ground cardamom, elaichi)▢ 1 cup onions cubed, 3 medium ▢ 1½ to 2 cups tomatoes finely chopped  (3 large)▢ ¾ teaspoon salt  (adjust to taste)▢ ¾ teaspoon sugar (optional)▢ 12 to 14 cashew nuts (or 12 almonds)▢ ¾ to 1 teaspoon Kashmiri red chilli powder (or paprika)(adjust for best color)▢ ¾ to 1 teaspoon garam masala powder (adjust to taste)▢ 1 teaspoon coriander powder (daniya powder) (optional)▢ 1 cup water (to blend), ▢ 1 small bay leaf (tej patta)▢ ½ inch cinnamon piece (dalchini) (optional)▢ 2 green cardamom (elaichi) (optional)▢ 3 cloves (laung) (optional), ▢ 1½ to 2 tablespoon Butter▢ 1½ teaspoon ginger garlic paste  (or ¾ inch ginger, 3 medium garlic cloves, refer notes)▢ ½ cup water (adjust as required, to cook the gravy)▢ 200 to 250 grams paneer (2 heaped cups diced)▢ 1 teaspoon kasuri methi (dried fenugreek leaves)▢ 3 tablespoon cream (heavy cream, whipping cream or cooking cream)▢ 2 tablespoon coriander leaves (cilantro finely chopped) (for garnish)",
        "Instructions": "▢ Heat oil in a pan. Add green cardamoms & onions. Stir fry until they turn transparent to light pink. (If you do not have ginger garlic paste for this recipe, you may add chopped ginger and garlic along with onions)▢ Next add tomatoes & salt. Saute for 3 minutes. Cover and cook till the onion & tomatoes turn soft & completely mushy.▢ Add garam masala, coriander powder, cashew nuts, red chili powder & sugar (optional). ▢ Stir fry this till the onion tomato masala turns aromatic. This takes 2 to 3 minutes.▢ Turn off the stove & cool this completely. ▢ Transfer to a blender & pour water. Blend to a really silky smooth puree. If it is not smooth, filter it through a strainer to another bowl. Set this aside., ▢ Heat butter in the same pan. Optional – When the butter melts, add cinnamon,  cloves, green cardamoms & bay leaf. ▢ Reduce the flame to low, saute ginger garlic paste for a minute until it smells aromatic.▢ Stir in the blended onion tomato puree. Taste test your puree & optionally you may add more red chili powder for a deeper color.▢ Pour more water & mix well. Bring it to a rolling boil. Reduce the heat to medium and cook covered until the gravy cooks down to a thicker consistency. Keep stirring every few minutes.▢ You know the gravy is done when it turns thick and traces of fat is visible on the gravy. Taste test and add more salt or garam masala if needed.▢ Lower the flame completely, add cubed paneer. Take kasuri methi to your palm and crush it in between your palms. Sprinkle this.▢ Mix & cook covered on a low heat for 2 minutes. Turn off and pour cream (save some for garnish) & stir.▢ Transfer paneer butter masala to a serving bowl. Garnish with more cream & chopped coriander leaves. Serve this with butter naan , Basmati rice or jeera rice."
    },
    {
        "Title": "Samosa Recipe, How to Make Punjabi Samosa",
        "Ingredients": "▢ 2 cups (250 grams) all-purpose flour (organic/ unbleached)▢ ¼ cup (60 ml) oil or melted ghee▢ 6 tablespoons (90 ml) water▢ ¾ teaspoon carom seeds (ajwain)▢ ¾ teaspoon salt, ▢ 4 medium (500 grams) potatoes▢ ½ cup green peas (boiled or frozen)▢ 1 tablespoon oil or ghee▢ 1 tablespoon ginger minced or paste▢ 1 to 2 green chilies chopped (optional)▢ 1 pinch hing (asafoetida) (optional)▢ 4 tablespoons coriander leaves chopped finely▢ 1 teaspoon lemon juice (or ½ tsp amchur or chaat masala)▢ ½ teaspoon salt (adjust to taste), ▢ ¾ teaspoon cumin seeds▢ ¾ to 1 teaspoon garam masala▢ ¾ teaspoon red chilli powder (adjust to taste)▢ ½ teaspoon cumin powder▢ ½ teaspoon fennel powder (optional), ▢ Mint Chutney (or make from separate recipe card below)▢ Tamarind Chutney (or make from separate recipe card below), ▢ 3 tablespoons tamarind paste  (or 2 tsps. concentrate, more if required)▢ ½ cup jaggery / brown sugar▢ ⅛  teaspoon Kashmiri red chili powder▢ ½ teaspoon cumin powder▢ ¼ teaspoon garam masala▢ ¼ teaspoon ground fennel▢ ¼ teaspoon ground ginger▢ ¼ teaspoon black salt  (or sea salt only if needed, your tamarind paste may contain salt)▢ ¾ cup water, ▢ 2 cups mint leaves (use only leaves, no stalks, sub with cilantro)▢ 1 cup cilantro/ coriander leaves  (include tender stalks, sub with mint)▢ 2 cup yogurt / thick curd▢ 1 teaspoon sugar (adjust to taste)▢ 1 teaspoon salt (adjust to taste)▢ ⅓ inch ginger peeled▢ 2 small garlic cloves peeled▢ 1¼ teaspoon roasted cumin powder (bhuna jeera powder)▢ 1 teaspoon chaat masala (optional, for the authentic flavors)",
        "Instructions": "▢ Peel, halve and boil potatoes in a pot of water, until fork tender (not mushy). Or (pressure cook unpeeled potatoes for 5 whistles on a medium flame or in the instant pot for 8 mins, placed over a trivet. When the pressure drops, cool & peel them.)▢ Crumble the potatoes, don't mash them. Keep aside., ▢ Mix together flour, carom seeds, salt and oil in a mixing bowl.▢ Rub the flour well with your fingers or in between your palms for 3 to 4 mins to incorporate the oil. It should look like breadcrumbs and this is very important to make flaky samosa.▢ Take handful of flour and press down with your fingers. It must hold shape and not crumble. This is an indication that the oil is well incorporated. (check video or photos in the post)▢ Add water little by little and mix the flour to form a slightly stiff yet pliable dough. (Check pictures in the post). It should not be very soft like roti/naan dough. Cover and rest for 25 to 30 mins., ▢ Heat a pan with oil. Add cumin seeds.▢ When they begins to sizzle, add ginger & green chilies. Fry until ginger smells aromatic, for about 30 to 60 seconds.▢ Stir in the green peas and saute for 2 mins.▢ Add red chilli powder, garam masala, cumin powder, chaat masala (optional) & fennel powder. Saute for 30 seconds.▢ Stir in the potatoes and sprinkle salt. Mix and saute for 2 to 3 mins. Mix in coriander leaves & set aside to cool.▢ Taste and add more salt if needed. If using lemon juice, add it now. Divide the mixture roughly to 10 portions., ▢ Knead the dough gently to smoothen a bit. Divide it to 5 portions and roll to balls. Cover the dough balls until the end, to prevent drying out.▢ Grease the rolling area and then flatten a ball. Drizzle a few drops of oil.▢ Begin to roll to a circle or oval shaped disc. (Around 8.5 inches long by 6.5 inches wide). It should be neither too thick nor too thin. (Watch video)▢ Using a knife cut it to two semicircles. The 2 parts make 2 samosas. If the edges are too thick, gently roll it to thin down.▢ Work on one part – apply water over the straight edge (towards the cut side). Join the edges to make a cone. Press down gently to seal the cone from inside as well. (Check video or photos above) (If you have trouble sticking them, make a paste of flour and water, smear that lightly & then stick)▢ Fill the cone with one portion of potato masala and press down with your finger to push it inside the cone. Smear water generously on both the other edges.▢ Bring the edges together and seal them by pinching off the edges together. If you prefer to make a standing samosa, make a pleat on one side. Bring back the pleat and seal it by pinching off the edges together. (Check video or photos above)▢ Make sure the samosa is sealed well. Cover them with a cloth to prevent drying., ▢ After you make 5 samosas, begin to heat the oil until medium hot.▢ Oil has to be medium hot and not very hot or cold. A piece of dough dropped in the oil should not sizzle or rise immediately. Instead you should see tiny bubbles in the oil & the dough should take a while to come up to the surface. This is the right temperature.▢ Gently add as many samosas as you can to the oil and fry them on a low flame, undisturbed for few minutes (about 10 to 12 mins).▢ When the crust becomes firm, increase the flame to medium. Turn them to the other side and fry until crispy and golden.▢ While the first batch of samosas fry, make the rest of them. Remove the golden fried samosas to a wired rack or a steel colander. Let the temperature of oil come down slightly before you fry the next batch.▢ Serve samosa with mint chutney, sweet tamarind chutney or tomato ketchup., ▢ Preheat the oven at 180 C or 360 F for about 20 mins. Brush each samosa generously with oil all over and place them on a prepared tray. Bake these for about 35 to 40 mins., ▢ Spray your samosa with oil or brush with ghee. Preheat your air fryer for 7 mins at 360 F or 180 C if required.▢ Place the samosa in the air fryer basket or tray spacing them at least an inch apart from each other.▢ Air fry for 12 mins, turn them to the other side and air fry for another 5 to 6 mins, or a little longer until golden and crisp. (In non-preheated air fryer air fry at 370 F or 190 C for the same time)▢ Brush them with ghee or oil as required., ▢ Mix together cumin powder, garam masala, red chili powder and fennel in a small sauce pan. Toast them on a low heat for 30 to 60 seconds, until aromatic. Do not burn.▢ Add the jaggery, tamarind paste and pour water. Mix well and simmer until slightly thick, a sauce like consistency.▢ Stir in the ginger and black salt during the last 1 minute of cooking. It takes about 8 to 10 mins for the tamarind chutney to reach the right consistency.▢ Taste test and add more salt, tamarind, jaggery or any other spice as required to taste., ▢ Blend together mint, cilantro, salt, ginger, garlic, green chilies, roasted cumin powder, sugar, salt and 2 to 3 tbsp cold yogurt to a smooth paste.▢ Whisk yogurt until smooth and stir in the blended paste. Stir in the chaat masala.▢ Taste test and adjust salt, chili and sprinkle lemon juice if required. Serve with kebabs, snacks & sandwiches."
    },
    {
        "Title": "Butter Chicken Recipe (Indian Chicken Makhani)",
        "Ingredients": "▢ ½ kg (1.1 lbs)  boneless chicken  (read notes)▢ ½ to ¾ teaspoon Kashmiri red chili powder  (or paprika adjust to taste, reduce for kids)▢ ¼ to ⅓ teaspoon salt  (adjust to taste)▢ ¾ to 1 tablespoon lemon juice, ▢ ⅓ cup Greek yogurt  (hung curd/thick curd, refer notes)▢ ¾ tablespoon ginger garlic paste▢ ⅛ teaspoon turmeric  (haldi)▢ ¾ to 1 teaspoon garam masala  (adjust to taste)▢ ½ teaspoon cumin powder  (optional)▢ 1 teaspoon coriander powder  (optional)▢ 1 teaspoon kasuri methi  (optional, dried fenugreek leaves)▢ ¾ to 1 tablespoon oil, ▢ 2 to 3 tablespoons butter  or ghee (divided)▢ 2 inch cinnamon piece▢ 2 to 4 green cardamoms▢ 2 to 4 cloves▢ 1½ cups (130 grams) onions sliced (optional, *updated)▢ 3 cups (600 grams, 24 oz)  fresh tomato puree (or 1 cup passata/canned tomato puree)▢ ¾ tablespoon ginger garlic paste▢ 1 to 2 green chilies  (deseed, slit or chop, optional)▢ 28 (42 grams) whole raw cashews  (soaked in hot water if required, read notes)▢ ½ cup water  to blend (more if required)▢ 1 to 2 teaspoons Kashmiri chili powder  (reduce for kids, adjust to taste)▢ 1 to 1½ teaspoons garam masala  (divided, adjust to taste)▢ 1 to 1½ teaspoon coriander powder  (optional, adjust to taste)▢ ½ teaspoon cumin powder  (optional, adjust to taste)▢ ½ to ¾ teaspoon salt  (adjust to taste)▢ 1 teaspoon sugar  (to balance the flavors)▢ ½ tablespoon Kasuri methi  (dried fenugreek leaves)▢ 1½ cups hot water to make gravy▢ ⅓ cup (80 to 100 ml) heavy cream  or whipping cream (divided)▢ 2 tablespoons coriander leaves (fine chopped to garnish)",
        "Instructions": "▢ Marinate chicken with lemon juice, chili powder and salt. Cover and rest for 20 minutes. Next add yogurt, kasuri methi, oil, turmeric, ginger garlic paste, coriander powder, cumin powder and garam masala powder.▢ Marinate and rest for a minimum of 30 minutes, or overnight for best results. Cover and refrigerate.▢ Optional – If using onion, sauté in 1 tablespoon oil until lightly golden, for 7 minutes. Cool down.▢ To a blender, add tomatoes, sautéed onions, cashews and water. Blend to a smooth puree. If you want you can also blend the cashews separately with water to a smooth cream., ▢ Remove the chicken from the refrigerator, to bring it close to room temperature.▢ Melt butter in a pan & add all the whole spices – cinnamon, cloves and cardamoms.▢ When they begin to sizzle, stir in the ginger garlic paste & green chilies. Fry on a low heat, for a minute or 2, till it turns fragrant but not burnt.▢ Turn off the heat and stir in red chili powder, garam masala, cumin and coriander powder.▢ Stir in the tomato cashew puree. If it is not smooth, strain it to the pan.▢ Mix well and cover partially. Bring it to a boil on a medium high heat, reduce the heat to low or medium. Cook until the puree turns thick, keep stirring occasionally.▢ Pour hot water and simmer for 10 mins, until the sauce thickens & traces of fats are visible on top of the sauce., ▢ Spread one tbsp. butter or ghee in a griddle/pan and heat it well. Place the marinated chicken pieces, spacing them a little apart.▢ Fry on a medium heat for 2 mins and turn them. Don’t burn and do not overcook. Cook till the chicken is just cooked and all the marinade dries up. It is not necessary to fully cook the chicken at this stage.▢ This way roast the chicken pieces in 2 to 3 batches, depending on the size of your skillet., ▢ Add chicken to the butter chicken gravy. Pour more hot water (about ½ cup, not in the recipe) if the sauce is too thick. Cover and simmer for about 5 to 7 minutes till it becomes tender.▢ Stir in salt, sugar and kasuri methi. Taste test and optionally add more garam masala & another tablespoon butter for additional flavour (both are optional).▢ Turn off and stir in the heavy cream. Garnish Butter Chicken with chopped coriander leaves and some cream. Serve with Turmeric rice, steamed Basmati Rice, Butter naan or Cumin Rice."
    },
    {
        "Title": "Chana Masala Recipe",
        "Ingredients": "▢ 1 cup chana (dried raw chickpeas) (or 3 cups soaked or 2 – 15 oz cans)▢ 1½ cups water (to pressure cook, + more to make gravy), ▢ 2 tablespoon oil  or as needed▢ 1 small bay leaf (optional)▢ 1 inch cinnamon  (optional)▢ 2  cloves (optional)▢ 2 green cardamoms (optional)▢ 1½ cups onions (fine chopped, 2 large)▢ 1 green chili  slit (optional)▢ ¾ to 1 tablespoon ginger garlic paste (or ½ tbsp each fine chopped) ▢ 1½ cups tomatoes (fine chopped, 3 large or 1½ cups tomato puree)▢ ¾ teaspoon salt (+ more to adjust to taste)▢ ¼ teaspoon turmeric▢ 1½  teaspoons Kashmiri red chili powder (adjust to taste)▢ 1  teaspoon garam masala  (adjust to taste)▢ 2 teaspoon coriander powder▢ ½ teaspoon cumin powder (optional)▢ 1 teaspoon kasuri methi (dried fenugreek leaves) (optional)▢ ¼ teaspoon amchur  (dried mango powder) (optional)▢ 2 tbsp coriander leaves (cilantro chopped finely)",
        "Instructions": "▢ Rinse dried chickpeas at least thrice. Soak them in 3 ½ to 4 cups of water overnight or for at least 8 hours.▢ Drain the water and rinse them well. Pour water and pressure cook for 5 to 6 whistles on a stovetop cooker. You may also cook in an instant pot for 18 minutes on a high pressure. Let the pressure drop naturally.▢ Make sure your chickpeas are soft and tender. Squeeze a chickpea to test, it should get mashed fully. If not cook them for a little longer., ▢ Heat a large pot and pour oil. When the oil turns slightly hot, add the whole spices – cinnamon, cloves, cardamoms and bay leaf.▢ When they begin to sizzle add the onions and green chili. Saute until they turn light golden.▢ Add ginger garlic paste and saute for a minute without burning.▢ Add tomatoes and salt. Let cook until mushy, pulpy and thick.▢ Stir in red chilli powder, turmeric, garam masala, coriander powder and cumin powder. Saute until the masala begins to smell good, for about 3 to 4 mins.▢ Optional – If you want a smooth curry, cool this, discard the bay leaf, green chili and cinnamon. Blend in a blender to a smooth or coarse paste to suit your liking. I prefer to blend in 2 tbsps cooked chana along with the onion tomato masala. Add that puree back to the pan.▢ Add the chana along with the chana stock or water (1¼ cups). Pour another ¾ to 1 cup water. If you don't puree the onion tomato masala, you will require lesser water. If using canned chickpeas, drain and rinse them before adding with 1¾ cups water.▢ Mix well. Taste test and add more salt. Cover and simmer for 15 minutes.▢ When the consistency is thick (check pics), add amchur powder (optional) and kasuri methi.▢ Garnish Chana masala with coriander leaves. Sprinkle some lemon juice if required. Serve with Basmati Rice, Jeera Rice, Naan or Chapati., ▢ To make the recipe in Instant pot, make the onion tomato masala on saute mode. Optionally If you want you may cool and blend this. Add the soaked chickpeas with 2 cups water. Deglaze and Pressure cook on high for 35 minutes. When the pressure drops, open the lid. Cook on a saute mode for a few minutes until thick. Add kasuri methi and amchur."
    },
    {
        "Title": "Palak Paneer Recipe (Indian Spinach Paneer)",
        "Ingredients": "▢ 150 grams (1¼ cups) paneer   (Indian cottage cheese)▢ 3½ to 4 cups (100 to 120 grams) palak (spinach) ▢ 2 tablespoons oil  (or half oil & half butter)▢ 2  green chilies (deseeded) (less spicy kind)▢ ¾ cup  ( 90 grams, 1 small) onions  (fine chopped)▢ ½ cup (2 small)  tomatoes  (deseeded & chopped or pureed)▢ ¾ teaspoon ginger garlic paste (read notes for substitute)▢ ½ teaspoon salt  (use as per your taste)▢ 8 to 10 cashewnuts (read notes for substitutes)▢ ½ to ¾ teaspoon garam masala (adjust to taste)▢ ½ teaspoon kasuri methi (dried fenugreek leaves) (skip if you don't have)▢ ¼ cup water to blend spinach▢ ¾ cup water to cook the gravy▢ 3 tablespoons cream (optional), ▢ ⅛ teaspoon cumin seeds (jeera) (optional)▢ 2 green cardamoms (elaichi) (optional)▢ 1 inch cinnamon (dalchini) (optional)▢ 2 cloves (laung) (optional)",
        "Instructions": "▢ Pluck only the young & tender spinach leaves and discard the stems as they may leave a bitter taste. If using baby spinach you can use the stems as well.▢ Add them to a large pot of water. Rinse them well few times & drain to a colander.▢ Allow the water to drain completely otherwise it will let out lot of moisture while cooking.▢ Heat half tablespoon oil in a pan. Saute green chilies, cashews and spinach for 3 to 4 mins until the leaves wilt off thoroughly & raw smell of spinach has gone away. [OR another option is to blanch the palak in 4 cups of hot water with ¼ tsp salt for 2 mins. Then immerse in ice cold water. Drain completely.]▢ Cool this completely. Blend this along with water to a smooth puree. The puree should be smooth and thick. You may add 1 to 2 tbsps more water to help in blending., ▢ Heat 1 tablespoon butter and half tablespoon oil to the same pan, Once they melt, add cinnamon, cardamoms, cloves & cumin seeds. ▢ When the spices begin to sizzle, add onions and fry till they turn transparent to golden.▢ Next saute ginger garlic paste for 1 to 2 minutes or until you begin to smell it nice.▢ Then add tomatoes with salt. Saute until they break down and turn mushy.▢ Add garam masala & saute until the masala smells good. This may take 2 mins. (for a smoother curry refer notes)▢ Pour water and cook covered until onions are completely soft. There should be some water left in the pan. (for consistency check video)▢ Lower the flame, add kasuri methi and pureed spinach. Mix well and cook until it begins to bubble for about 2 to 3 mins. If the curry is too thick you may add a few tbsps of hot water.▢ Avoid overcooking. Add paneer & mix well. Turn off and remove to a serving bowl. Optionally garnish with cream.▢ Serve palak paneer with naan, roti, Basmati rice or Jeera rice."
    },
    {
        "Title": "Dal Makhani Recipe (Restaurant Style)",
        "Ingredients": "▢ 1 cup whole black lentil (200 grams black gram – whole urad dal)▢ ¼ cup rajma  (red kidney beans) (optional)▢ 4 cups water for pressure cooking – more for pot, ▢ 3 tablespoons unsalted butter (divided – 1 ½ tbsp + 1 ½ tbsp)▢ 1 tablespoon ghee▢ 1 medium onion finely  chopped (65 grams)▢ 1 tablespoon ginger garlic paste▢ 1 cup tomato puree (210 grams)▢ 2 teaspoons salt (adjust to taste)▢ ¾ to 1½ teaspoons red chilli powder (adjust to taste) (I use 1½)▢ 1 teaspoon garam masala (use flavorful one)▢ 2 cups water (preferably boiling hot)▢ ½ teaspoon kasuri methi (dried fenugreek leaves) (optional)▢ ¼ cup cream (more for garnish, heavy cream, whipping cream), ▢ 1 bay leaf (optional)▢ 2 green cardamoms (optional)▢ 1 black cardamom (optional)",
        "Instructions": "▢ Add urad dal and rajma to a large pot and rinse them well a few times. Drain the water and soak them in 3 to 4 cups of water for 7 to 8 hours. To reduce the soaking time, you may soak them in boiling hot water for 4 to 5 hours.▢ Later drain the water and rinse them well., ▢ Pour 4 cups fresh water and pressure cook for 10 whistles on a medium heat. You can also cook in a pot until soft and tender adding more water as needed. If cooking in instant pot, pressure cook on high pressure for 20 mins. ▢ Both urad dal and rajma must cook to very soft. When mashed with a spoon the dal and rajma must be soft and get mashed well easily.  If not then pour another half cup hot water and continue to cook for another 3 to 4 whistles on a medium heat.  ▢ Heat a heavy bottom pot with butter & ghee. If using whole spices, add them and saute for half a minute. Then add onions and fry until they turn golden.  ▢ Stir in ginger garlic paste and saute for 1 minute until the raw smell goes away.▢ Then transfer tomato puree and cook for 3 to 4 minutes until thick.▢ Add salt, chilli powder & garam masala.   Saute well until the masala smells good and turns thick. ▢ Mash the cooked urad dal slightly and pour it along with the stock. Pour another 1 cup hot boiling water & mix.▢ Cook on a low flame until the dal thickens stirring often in between to prevent burning the bottom. After 60 mins, the dal thickens. ▢ Add another ½ to 1 cup hot boiling water and continue to cook until thick. This takes another 30 mins. Totally cook for about 90 mins from the time you added the cooked dal to the pot.▢ Then add kasuri methi and pour cream. Stir and cook again for 6 to 8 mins until it becomes thick and creamy.▢ Taste and add more salt if needed. Add butter and mix well., ▢ Place a small piece of foil or a tall steel cup on the dal makhani. Hold 1 to 2 inch piece of natural wood charcoal with a tong and burn it on direct fire until red hot. Then place it on the foil kept over dal or in the steel cup. ▢ Quickly pour ¼ tsp ghee on the hot coal. Immediately cover the pot and allow to smoke for 3 to 4 mins. For stronger flavor, add another ¼ tsp ghee on the coal and repeat the smoking.▢ Garnish dal makhani with butter or cream & serve with fluffy Basmati rice or naan., ▢ Press SAUTE button on the Instant pot. Add ghee and butter to the steel insert.▢ Once the butter melts, add onions and saute until transparent. Add ginger garlic paste and saute for 30 seconds.▢ Pour the tomato puree, red chilli powder & garam masala. Saute for 3 to 5 mins.▢ Drain the water from the lentils and add them. Pour 3 cups water and deglaze the pot by scrubbing the bottom with a wooden spatula.▢ Press CANCEL button. Secure the Instant pot with the lid. Position the steam release handle to sealing.▢ Press PRESSURE COOK button and set the timer to 30 mins.▢ When the IP finishes it will beep. Wait for the pressure to release naturally.▢ Open the lid.  You will see the dal being runny at this stage.  Add salt & slightly mash the urad dal, not rajma. ▢ Press SAUTE button. Adjust the setting to LOW by pressing the saute button twice.▢ Cook further stirring often until thick. When most of the moisture evaporates, dal turns thicker. Optional – I prefer to add 1 more cup of hot water in 2 batches, ½ cup each time. Cook further until really creamy and thick. ▢ Then add cream and kasuri methi. Continue to cook until creamy.▢ Stir in the butter and garnish dal makhani with cream."
    },
    {
        "Title": "Matar Paneer Recipe (Mutter Paneer)",
        "Ingredients": "▢ 1 tablespoon (15 ml) oil▢ 1 to 2 green cardamoms (optional, omit if you don't like)▢ 3 (8 grams) garlic  (medium sized cloves )▢ 1 inch (8 grams) ginger  (peeled & sliced/ chopped)▢ 1 cup (110 grams) onions  cubed (1 large or 2 medium)▢ 1½ to 1¾ cups (340 grams) tomatoes (2 to 3 large) fine chopped▢ 12 (20 grams) cashewnuts (or almonds, soaked for 2 hours and blanched)▢ ½ teaspoon salt▢ ¼ to ⅓ cup curd (yogurt, optional, refer notes), ▢ 1½ tablespoon (22 ml)  oil or ghee▢ 1 inch cinnamon (dalchini) (optional)▢ 1 small bay leaf (optional)▢ ¼ teaspoon turmeric▢ ¾ to 1 teaspoon Kashmiri red chili powder  (adjust to taste)▢ ¾ to 1 teaspoon garam masala (adjust to taste)▢ ½ to ¾ teaspoon coriander powder▢ 1 teaspoon sugar▢ 1 cup green peas (matar) (boiled or frozen)▢ 1 to 1 ¼ cup water (use more if needed)▢ 1 green chili deseeded & slit (optional)▢ 250 grams paneer (indian cottage cheese)▢ 1 teaspoon kasuri methi  (dried fenugreek leaves)▢ ¼ teaspoon salt  as needed (about ¼ to ½ tsp)▢ 2 tablespoon coriander leaves (cilantro)▢ 3 to 4 tablespoon cream (optional)",
        "Instructions": "▢ If using store bought paneer, soak it in a bowl of hot water for 20 mins. Drain the water and use. This step helps to keep the paneer soft.▢ Pour oil to a hot pan. When the oil turns hot, add green cardamoms (optional), ginger & garlic. 1 tablespoon (15 ml) oil, 1 to 2 green cardamoms, 3 (8 grams) garlic, 1 inch (8 grams) ginger▢ Fry for a minute. Next add chopped onions & saute until they turn light golden. 1 cup (110 grams) onions▢ Add tomatoes and salt. 1½ to 1¾ cups (340 grams) tomatoes, ½ teaspoon salt▢ Saute for 2 to 3 mins. Add cashews. Cook covered until soft & mushy. 12 (20 grams) cashewnuts▢ Cool this completely. Add to a grinder along with curd/ yogurt (optional) and make a smooth puree. ¼ to ⅓ cup curd, ▢ Heat oil in the same pan. Add cinnamon & bay leaf, let sizzle in oil for a minute. ▢ Lower the heat and add turmeric, chili powder, sugar (optional), garam masala and coriander powder. Mix well.▢ Pour the pureed onion tomato mixture. If your puree is not smooth, then pass it through a filter/sieve.▢ Saute until the masala comes together and turns thick. Keep stirring to prevent burning.▢ Next add green peas. Pour water. If using fresh peas, boil them until tender in a pot, drain and use. If using frozen peas then you can rinse and use. ▢ Mix well to make a thick gravy. Add more water if needed.▢ Mix and cook covered on a medium heat until the gravy thickens and traces of oil appear over the gravy.▢ Crush kasuri methi in your palm & sprinkle all over. Mix well. ▢ Check salt and add more if needed. Add green chilli (optional) & cubed paneer. ▢ Cover and cook just for 2 mins. Sprinkle coriander leaves and cream. ▢ Stir well. Serve matar paneer with Basmati rice, jeera rice, naan or paratha., ▢ Grate or crush the ginger garlic. Keep aside. Sauté onions in 1 tbsp oil for 5 mins in the Instant pot. Or Alternately bring 1½ cups water to a rolling boil and add the onions. Boil for 5 mins and remove them. ▢ To a blender jar, add boiled/sauteed onions, chopped tomatoes, cashews, cardamoms and yogurt (optional). Blend them to make a very smooth puree without adding water.▢ Press saute button on the instant pot and pour oil. Do not let the pot become too hot. Add bay leaf, cinnamon and ginger garlic (to a side into the oil). Saute for 30 seconds.▢ Pour the onion tomato puree. Add red chilli powder, turmeric powder, salt, sugar, coriander powder and garam masala.▢ Saute until the mixture turns slightly thicker and aromatic. Cover with an external lid to avoid splatters. This step takes about 5 minutes. Press cancel button.▢ Pour 1 cup water and deglaze the pot well. Secure the Instant pot with the lid and position the steam release valve to sealing. ▢ Press pressure cook button (low) & set the timer to 5 mins. If you want to put your rice together, soak basmati rice for 30 mins and drain the water. Place the rice bowl over a trivet and pour hot water.▢ When the IP is done, wait for 6 to 7 minutes & then release the rest of the pressure manually. ▢ Stir the gravy. Add green peas and cook for 2 minutes. (If you are using fresh peas, you will need to boil them separately and then add here.) To avoid splatters, cover the pot when you cook.▢ Taste test and add more salt if needed. If the curry is runny, cook it on saute mode for a few minutes. ▢ Add kasuri methi, cream and paneer. Stir and Press cancel. Remove the steel insert carefully & cover the pot immediately. Let matar paneer rest for 10 minutes."
    },
    {
        "Title": "Pav Bhaji Recipe (Mumbai Street Style)",
        "Ingredients": "▢ 1½ to 2 cups (300 grams) potatoes diced (3 medium or 2 large) ▢ ½ to ¾ cup (75 grams)  green peas (matar)▢ 1 cup (100 grams)  cauliflower (florets, optional)▢ ½ cup  (75 grams) carrot (optional, 1 small)▢ 1½  cups water (to pressure cook, 2 cups for IP, more to cook in pot)▢ ¾ to 1 cup (125 grams) onions (finely chopped, 1 medium)▢ 1 green chili  (slit or chopped, leave out for kids, optional)▢ 1 tablespoon ginger garlic paste or chopped▢ ½ cup capsicum  (bell pepper) chopped▢ ¾ to 1 cup (125 grams) tomatoes (finely chopped, 2 medium )▢ 1 tablespoon oil▢ 1 tablespoon butter▢ 1 to 1½ teaspoon Kashmiri red chili powder (or red chili paste from 10 dried red chilies)▢ ¼ teaspoon turmeric ▢ 1 to 1½  tablespoon pavbhaji masala powder (use more if needed)▢ ¾ tablespoon kasuri methi  (dried fenugreek leaves, optional)▢ 1 teaspoon salt, ▢ 8 Pav (buns) (dinner rolls)▢ 1 tablespoon butter  (to toast pav)▢ ½ teaspoon pav bhaji masala  powder, ▢ 1 Lemon (sliced)▢ 2 to 4 tablespoon onions Chopped finely▢ 2 tablespoon coriander leaves▢ 2 tablespoon butter (divided between servings)",
        "Instructions": "▢ Add cauliflower florets, cubed potatoes, carrots and peas to a pot or pressure cooker. Pour water and cook until soft or tender. If you cook in a pot you will need more water.▢ If cooking in pressure cooker, cook on a medium heat until you hear 2 whistles. When the pressure drops open the lid and mash them well., ▢ Add butter and oil to a pan and heat up on a medium flame. Add onions and saute till they turn translucent.▢ Stir in ginger garlic paste and green chili. Saute until fragrant.▢ Next capsicums & saute for 3 to 4 minutes. Add tomato and salt. Saute until the tomatoes soften and become mushy.▢ Stir in chili powder, turmeric and pav bhaji masala powder. Saute the masala for another 2 minutes or until the raw smell of the mixture goes away.▢ Add boiled & mashed veggies. Pour more water (½ to ¾ cup)  just enough to bring to a thick consistency.▢ Cook for 3 to 5 mins until the bhaji thickens. Taste and add more salt if needed. If you want it more spicy, add another half tsp chilli powder and cook for 3 to 4 minutes.▢ Add kasuri methi and cook until it reaches a desired consistency thick yet of pouring consistency., ▢ Slit the pav buns horizontally leaving one edge intact. ▢ On a low to medium flame, heat butter on a pan/ griddle. Open the pav and sprinkle some pav bhaji masala on the butter. Place the pav, inner side on the butter & toast them for a min or two. ▢ Scoop out portions of bhaji to serving bowls. Garnish it with onions, butter and coriander leaves. Squeeze some lemon juice. Serve pav bhaji hot or warm. Dip your pav into the bhaji and enjoy., ▢ Press SAUTE button on the instant pot. Add oil and butter to the steel insert.▢ Saute onions and green chili until the onions become transparent. Stir in ginger garlic and fry for 30 seconds.▢ Add tomatoes, capsicum and sprinkle salt. Saute until the tomatoes turn soft and mushy.▢ Stir in pav bhaji masala, chilli powder and turmeric. Add all the veggies – potatoes, cauliflower florets, carrots and green peas.▢ Pour 2 cups water (1x) and deglaze the pot by scrubbing the bottom with a wooden spatula.▢ Press CANCEL button and press PRESSURE COOK button with high pressure setting. Set the timer to 5 mins and position the steam release vent to sealing.▢ When the IP completes, it beeps, wait for 5 mins for natural pressure release. Gently release the rest of the pressure manually.▢ There will be lot of water when you open the lid. With a masher, mash all the veggies well, they will soak up the water.▢ Press SAUTE button. If needed add more salt, pav bhaji masala and more red chilli for a brighter color. I usually add ½ teaspoon more red chilli powder at this stage.▢ Let the bhaji simmer for 3 to 4 mins, until thick. Then add add crushed kasuri methi and mix. Press cancel. Sprinkle coriander leaves and 1 tablespoon butter.▢ Slit each bun to 2, horizontally, keeping one edge intact. Heat a pan. Smear some butter and sprinkle pav bhaji masala over the butter. (check images above) Toast the pavs until lightly crisp. ▢ Transfer bhaji to serving bowls. Top with butter & coriander leaves. Squeeze some lemon juice.▢ Serve alongside toasted buns and freshly cut onions."
    },
    {
        "Title": "Dosa Recipe, How to Make Dosa Batter",
        "Ingredients": "▢ ½ cup urad dal (or whole skinned black gram)▢ ¾ to 1 cup cold filtered water (to blend dal)▢ 1½ cups rice (regular raw rice or basmati rice, Refer notes)▢ ½ cup cold filtered water (to blend rice, may need 2 tbsps more)▢ 2 tablespoon chana dal (bengal gram)▢ ½ teaspoon fenugreek seeds (methi seeds) (optional)▢ 2 tablespoon poha (flattened rice)▢ ½ teaspoon rock salt  (or non iodized salt or crystal salt), ▢ ½ cup whole urad dal (skinned whole black gram)▢ ¾ to 1 cup cold filtered water (to blend dal)▢ 1½ cup rice (regular raw rice or basmati rice, refer notes) ▢ ½ cup cold filtered water (to blend rice, may need 2 tbsps more)▢ ½ teaspoon methi seeds (fenugreek seeds) (makes dosas golden)▢ 2 tablespoons poha (flattened rice, or substitute ¼ teaspoon methi seeds)▢ ½ teaspoon rock salt  (or non iodized salt or crystal salt)",
        "Instructions": "▢ Rinse together urad dal, chana dal and methi seeds thrice and soak in enough water for 4 to 6 hours.▢ Rinse rice thrice and soak in enough water for 4 to 6 hours. (If you have a high speed blender you may rinse and soak them together, read faqs), ▢ Rinse and soak poha in ¼ cup water for 30 mins, before blending the batter.▢ Drain the water from the dal & transfer to a blender jar along with soaked poha and water. Grind to a smooth & bubbly batter. It should be of thick pouring consistency. Transfer this to a large pot (enough to hold the fermented batter).▢ Drain the water completely from rice & add it to the jar. Pour water and blend to a smooth or slightly coarse batter. It will be of thick pouring consistency.▢ Pour this to the batter bowl and mix well. (Check video to see the final consistency), ▢ Cover the bowl loosely and ferment it in a warm place until the batter rises and turns light & bubbly. It may take anywhere from 6 to 18 hours depending on the temperature.▢ If you live in a warm region, you can leave the batter bowl on the counter overnight.▢ To ferment in colder regions, preheat the oven at the lowest setting (120 F/ 50 C) for 7 mins, no longer. Turn off the oven and keep the dosa batter inside with the oven light ON. Alternately, place the batter bowl in your instant pot steel insert, press yogurt settings with a timer set to 8 hours (12 to 14 hours during colder days). Use an external lid and not the IP lid.▢ Optional Fermentation test: Well fermented dosa batter rises & increases in volume. It looks airy, with plenty of tiny bubbles. To test, drop half a spoon of this into a bowl of water. Well fermented batter floats. If it has not reached this stage, ferment longer.▢ Stir the dosa batter once. Transfer the required portion to a small bowl and add salt as required. Refrigerate the rest for up to 1 to 2 weeks.▢ The fermented batter usually becomes thick, pour little water to thin down & bring it to spreadable consistency. (Check video or photos in the post), ▢ Heat a dosa griddle/ tawa on a medium heat. When it is slightly hot, add a few drops of oil and spread it with a kitchen paper or a half cut onion (pierced with a fork/ butter knife on the rounded side to hold).This prevents the dosas from sticking to the pan.▢ To check if the pan is hot enough, sprinkle a few drops of water over the pan. If it is ready, it should sizzle.▢ Reduce the heat to low, stir the batter with a ladle and take a ladle (¼ cup) of dosa batter & pour in the center of the hot griddle/ tawa.▢ Immediately begin to spread it evenly with the base of the ladle – starting from the center, in an outward circular motion in a clockwise direction. (Check photos or video in the post)▢ Increase the heat to medium high or high and drizzle oil/ghee/ butter across the edges.▢ Cook until the base turns golden & crisp. Run a thin wooden turner/spatula across the base of the dosa, starting from the edges to the center.▢ Optional – If you want you may cook on the other side – turn it to the other side and cook for a minute. Turn again and cook the base for 30 seconds to crisp it.▢ Fold the dosa and remove from pan. Before making the next dosa, reduce the heat to low. You can also rub the cut onion and then pour the batter.▢ Serve dosa with coconut chutney, potato masala & tiffin sambar."
    },
    {
        "Title": "Upma Recipe, How to Make Rava Upma",
        "Ingredients": "▢ 1 cup Rava (Bombay rava/ sooji/semolina), ▢ 2 tablespoons oil or ghee (refer notes)▢ ½  teaspoon mustard seeds▢ ½   teaspoon cumin seeds (jeera, optional, adds aroma)▢ 1  teaspoon urad dal▢ 1½  teaspoon chana dal (optional, adds nice aroma)▢ 2 tablespoons peanuts (optional)▢ 8 to 12 cashews (you may leave out if using peanuts) ▢ 1 sprig  curry leaves▢ 1 pinch asafoetida (hing) (optional), ▢ 1 small onion (chopped or sliced thinly)▢ 2 green chili slit▢ ½ inch ginger (½ to ¾ teaspoon very finely chopped)(optional)▢ 3 cups water (2¾ cups for a drier upma, refer notes) ▢ ½ to ¾ teaspoon salt▢ 2 teaspoon ghee (optional)▢ lemon juice (optional) for serving",
        "Instructions": "▢ Add rava to a pan and dry roast on a low to medium heat until crunchy. Keep stirring often for even roasting.▢ Do not brown the rava as the flavor of upma changes. Transfer to a bowl. Set aside to cool. ▢ Chop onion, green chilies and  ginger. (Optional: To make vegetable upma (1x recipe), you can also use ¼ cup green peas, ¼ cup fine chopped carrots and 2 fine chopped French beans), ▢ Optional – If using peanuts, on a medium heat fry them in a teaspoon oil until deep golden and aromatic. Remove to a plate to use later to garnish.▢ Pour oil to a hot pan. Next add mustard seeds, cumin seeds, urad dal & chana dal. Fry until the dal turns light golden, add cashews.▢ Fry them stirring until the dal and cashews turn aromatic & light brown but not burnt.▢ Add hing, slit green chilies, chopped ginger and curry leaves. Saute for a minute. Add chopped onions and fry until transparent.▢ Optional: To make vegetable upma, you can add green peas, fine chopped carrots and French beans. Stir and cook covered until slightly tender.▢ Pour water and add salt. Mix and taste test the water. It has to be slightly salty. If needed add more.▢ Bring the water to a rolling boil. Set the flame to low. ▢ With one hand pour rava in a slow stream to the boiling water, while you stir the rava in the water with the other hand. This way incorporate the entire rava into the boiling water. (check video). Make sure the water is still boiling well consistently while you add the semolina.▢ Be quick at this stage. Stir everything once to check any lumps. Break up if any.▢ Cover and cook on the lowest flame until the water is completely absorbed. This just takes 2 to 4 mins depending on the kind of pot or pan used.▢ Open the lid and stir once.  Add ghee if you like. Give a quick stir.▢ Switch off the stove and cover again. Allow upma to rest for 5 mins, this helps it to become fluffy.▢ Serve rava upma plain or with spiced peanut podi, chutney, pickle or curd. Garnish with roasted/fried peanuts."
    },
    {
        "Title": "Idli Recipe (Idli Batter Recipe with Pro Tips)",
        "Ingredients": "▢ ½ cup urad dal or skinned black gram▢ 1 cup idli rice (or parboiled rice) or (1x- 1 cup + 2 tbsp idli rava)▢ 2 tablespoon thick poha  Or ½ tsp fenugreek seeds (methi seeds)▢ ½ teaspoon Non-iodized salt (rock salt or pink salt)▢ ¾ cup chilled water (¼ cup more if required, to grind dal) ▢ ½ cup water (to grind rice), ▢ ½ cup urad dal▢ 1½ cups idli rice (or parboiled rice)▢ ½ teaspoon fenugreek seeds (methi seeds)▢ 2 tablespoons thick poha (flattened rice) (substitute with ¼ tsp methi)▢ ¾ cup chilled water (¼ cup more if required, to grind dal)▢ ¾ cup water (to grind rice)",
        "Instructions": "▢ Add urad dal & methi seeds to a bowl.  Add rice or idli rava to another bowl. ▢ Wash them very well separately until water runs clear. Soak them separately  in lot of water for at least 6 hrs. ▢ Rinse and soak poha with ¼ cup water for about 30 mins before blending., ▢ After 6 hours, drain the water from both the bowls.▢ Add dal, methi, soaked poha, salt & water to a blender jar or a wet grinder.  You may need another 2 to 4 tbsps water while blending.▢ If you live in a hot climate then skip adding salt now and add it just before making idli else the batter turns sour. You will have to experiment with salt to know what works well for you.▢ Blend all of them till thick, smooth, bubbly & frothy. The idli batter should not turn hot or even warm as it makes dense idli.▢ Transfer urad dal batter to a large bowl.▢ A. If using rice : Add rice to the blender with water (mentioned in the ingredients). Grind to a little coarse batter (semolina texture). Pour this to the dal batter. Mix both of them well with your clean hands. The batter must be thick yet of pouring consistency. B. If using idli rava : Drain off the water thoroughly from the rava. Squeeze excess water from the rava with the help of both your palms. Rava must not look soggy. It must absolutely have no water in it, else the batter will become runny.▢ Transfer this to the urad dal batter and mix well.▢ Now mix everything well. Use your hand to mix as it helps to ferment faster and better. If needed can add little water, if the batter is too thick., ▢ Set the batter aside in a warm place for at least 8 to 14 hrs. The batter ferments and rises well to double the quantity. Sometimes it may take up to 18 hours depending on the weather and temperature. ▢ If you live in a cold country, keep it in the oven with the light bulb ON. Or preheat the oven to 120 F or 50 C for 10 to 12 mins. Keep the loosely covered batter bowl inside & turn off. If you have a instant pot or microwave (with yogurt function), then you can also turn it ON with the yogurt setting (low) for 6 to 12 hours or until the batter doubles.▢ A well fermented batter will yield good soft idli. The batter must rise and look fluffy but not turn sour. You will need to experiment to know the fermentation time., ▢ On a high flame, bring water to a boil in an idly steamer or a pressure cooker. If using instant pot, pour 1½ cups water to your inner pot. Press the saute button and bring the water to a rolling boil.▢ Meanwhile grease your idly plates lightly. Mix the idli batter gently 1 to 2 times only. Do not over do as the aerated batter will turn flat. Fill the molds with batter.▢ When the water begins to bubble and steam up, place the stand in the steamer. Cover and steam for exactly 10 mins on a high flame. If using Instant pot, when the water begins to boil,   press CANCEL button. Keep the idli stand in the IP. Cover with the lid & position the steam release handle to venting . Then press STEAM button. Use an external timer to monitor & steam for 10 to 12 mins.▢ Once done turn off and wait for 2 mins. Remove the idly stand. Set aside to cool down for 2 to 3 mins. When cooled, the idli must not be wet on top.▢ With the help of a spoon remove the idlis to a plate. Serve idli with a chutney or sambar."
    },
    {
        "Title": "Paneer Recipes",
        "Ingredients": "",
        "Instructions": ""
    },
    {
        "Title": "Dal Fry Recipe (Restaurant Style Dal Recipe)",
        "Ingredients": "▢ 1 cup toor dal (split pigeon peas) (or ¾ cup toor dal + ¼ cup moong dal or red lentils)▢ 2½ cups water  (3 cups for Instant pot, more for regular pot), ▢ 2 tablespoons ghee  (or oil or butter)▢ ½ to ¾ teaspoon cumin seeds▢ ½ teaspoon mustard seeds (optional)▢ ⅛ teaspoon hing (asafoetida)▢ 1 dried red chilli broken (optional)▢ 1 to 2 green chilies (slit or chopped) (optional)▢ 1 medium onion (¼ cup chopped finely)▢ 1 teaspoon ginger garlic paste (or ½ inch ginger & 2 garlic cloves fine chopped)▢ 1 large tomato (½ cup chopped or pureed)▢ ¼ teaspoon turmeric▢ ¼ to ½ teaspoon red chili powder (adjust to taste)▢ ¼ to ½ teaspoon garam masala (adjust to taste)▢ ¾ to 1 teaspoon salt  (adjust to taste)▢ ½  cup water (to use for consistency)▢ ½ teaspoon kasuri methi crushed (dried fenugreek leaves)▢ 2 tablespoons coriander leaves finely chopped, ▢ 1 to 2 tablespoons lemon juice  or as needed (optional)",
        "Instructions": "▢ Add 1 cup dal to a pot or cooker. Rinse it well a few times until water runs clear. (optional – To cut down the cook time, soak them for 30 minutes and drain the water.)▢ To cook in pressure cooker: Pour 2½ cups water. Pressure cook on a medium heat for 2 to 3 whistles. When the pressure releases, open the lid and mash the dal slightly.▢ To cook in pot:  Add dal to a heavy bottom pot and pour 3 cups water & bring it to a boil. Simmer uncovered until soft & mushy, adding more hot water as needed. To cut down the cooking time, soak it warm water for 30 mins and cook., ▢ Heat a pan with ghee, oil or butter. Add mustard seeds, cumin seeds and dried red chili. When the spices begin to splutter, add hing.▢ Next add onions and green chilies. Saute until the onions turn golden.▢ Add ginger garlic and saute until the raw smell of ginger garlic goes off. This takes about a minute.▢ Then add tomatoes and salt. Saute on a medium flame until tomatoes turn soft.▢ Add red chili powder, garam masala and turmeric. Saute for 2 mins till the masala begins to smell good & leaves the pan.▢ Add the mashed dal & mix well. Pour more water as needed to bring it to a desired consistency. (watch video)▢ Cook until the dal begins to bubble well. When dal fry reaches the desired consistency, crush kasuri methi in your palms and add it. ▢ Taste test and add more salt if needed. Garnish with coriander leaves. ▢ Serve dal fry with rice, roti, butter naan or paratha. When the temperature comes down slightly squeeze in some lemon juice., ▢ Press the SAUTE button instant pot and pour ghee to the steel insert.▢ When the ghee melts, add the cumin, red chilli & mustard (optional).▢ As soon as the spices pop, add hing, green chilli & onions.▢ Saute for 2 mins and then fry ginger garlic for 30 seconds.▢ Add in tomatoes and salt. Saute until the tomatoes turn soft and mushy.▢ Stir in red chilli powder, turmeric and garam masala. Add rinsed dal and pour 3 cups water.▢ Press CANCEL button. Mix well and scrape the bottom with the spatula to release any bits of food stuck.▢ Optional – You can also place a long legged trivet and then place your rice bowl and cover.▢ Secure the Instant pot with the lid. Set the steam vent to sealing position.▢ Press the PRESSURE COOK button, high pressure and set the timer to 8 minutes.▢ When the IP beeps wait for the natural release for 10 mins.▢ Mash the dal to suit your liking. Then add kasuri methi and coriander leaves. Taste test and add more salt if needed.▢ If you like thinner consistency you can add little hot water and mix.▢ Sprinkle some lemon juice over the dal fry & serve with rice."
    },
    {
        "Title": "Masoor Dal Recipe (Red Lentil Dal)",
        "Ingredients": "▢ ½ cup (95 grams) masoor dal  (red lentils)▢ 2 tablespoons (23 grams) moong dal (optional)▢ 2 medium (½ to ¾ cup) tomatoes (deseeded & chopped)▢ 1 green chili (optional)▢ 1¼ to 1½ cup water (for 1¾ cups for IP), ▢ 1 to 2 tablespoon ghee or (1 tbsp oil or 2 tbsps butter)▢ 1 dried red chili broken▢ 2 garlic cloves chopped▢ ¼ teaspoon mustard seeds (optional)▢ ½ teaspoon cumin seeds▢ 1 pinch asafoetida (hing)▢ ½ teaspoon salt  (adjust to taste)▢ ¼ to ½ teaspoon Kashmiri red chili powder (use up to ¾ for heat, adjust to taste)▢ ¼ teaspoon turmeric▢ ⅛ teaspoon garam masala (more if you want)▢ ½ teaspoon kasuri methi (dried fenugreek leaves)▢ 2 tablespoons coriander leaves fine chopped, to garnish▢ 1 to 2 tablespoons lemon juice to serve",
        "Instructions": "▢ Add masoor dal & moong dal (optional) to a pot or pressure cooker. Wash it a few times until the water runs clear.▢ Next add chopped tomatoes, water and green chili.▢ Pressure cook for 1 to 2 whistles on a medium heat. If cooking in a pot, bring the water to a rolling boil, reduce the heat and cook until soft, adding more hot water if needed. Skim off any froth that rises to the top.▢ Once the pressure drops, open the cooker.▢ Mash the dal to suit your liking. You can make it smooth or keep it coarse for a texture. If needed you can pour 2 to 3 tbsp hot water to bring it to a consistency., ▢ Heat ghee (or oil or butter) in a small pan, on a medium heat.▢ Add mustard seeds, cumin seeds, dried red chilies and chopped garlic.▢ Saute until the garlic turns slightly golden. Turn off the heat and add hing, chili powder, turmeric & garam masala.▢ Quickly pour this off to the dal. (If you want you may set aside half of the tempering along with red chili to garnish later.)▢ Time to add salt and crushed kasuri methi if using. Mix and simmer for 2 mins. Taste test and add more salt if required.▢ Squeeze in some lemon & garnish with chopped coriander leaves before serving. Masoor dal is ready to serve with roti or rice., ▢ Press saute button on the Instant pot and pour oil to the inner pot.▢ Add mustard, cumin, broken red chilies and garlic.▢ When they splutter add tomatoes along with salt, chilli powder, hing, garam masala (optional) and turmeric.▢ Saute for 1 min. Next add dal, green chilli and pour water. ▢ Stir well and deglaze to release any bits of food stuck. Secure the Instant pot with lid. Set the steam release handle to sealing.▢ Optional :You can cook basmati rice together by placing the rice bowl on a long legged trivet.▢ Press pressure cook button and set the timer for 7 mins.▢ Wait for the pressure to release naturally. When the pin drops, open the IP.▢ Add kasuri methi and stir well. Taste test and add more salt or garam masala if required. If the dal is runny, cook on saute mode for a few minutes. If it is too thick pour little hot water and saute for a minute.▢ Squeeze lemon juice and garnish with chopped coriander leaves. Serve masoor dal with rice."
    },
    {
        "Title": "Chana Dal Recipe (Bengal Gram Dal)",
        "Ingredients": "▢ ½ cup chana dal (bengal gram)▢ 1¼ cup water (1½ cups for pot & instant pot), ▢ 2 tablespoon ghee  or oil or butter▢ ½ to ¾ teaspoon cumin (jeera)▢ ⅛ teaspoon asafoetida (hing) (optional)▢ 1 small onion (¼ cup chopped)▢ 1 green chili chopped (skip if making for kids)▢ 1 teaspoon ginger or garlic (chopped or paste, ¾ inch ginger or 2 garlic cloves)▢ 1 medium tomato (½ cup chopped finely or ¼ cup tomato puree)▢ 1 dried red chili broken (less spicy variety, optional)▢ ½ teaspoon salt (adjust to taste)▢ ¼  teaspoon ground turmeric▢ ¼ to ¾ teaspoon Kashmiri red chili powder (adjust to taste)▢ ¼ to ½ teaspoon garam masala (adjust to taste)▢ ¼ to ½ cup water  (use as needed to bring to consistency)▢ ½ teaspoon dried fenugreek leaves (kasuri methi) (optional), ▢ 2 tablespoons coriander leaves (cilantro chopped finely)▢ 1 tablespoon lemon juice or ¼ to ½ tsp dried mango powder (amchur powder)",
        "Instructions": "▢ Add chana dal to a pot or cooker. Rinse a few times until water runs clear. Soak it in regular water for 1 to 4 hours as per your convenience. ▢ Later drain the water and pour 1¼ cups fresh water. If cooking in a pot pour 1½ cups water.▢ Cook chana dal on a medium heat until soft and completely done. Dal must hold shape, yet get mashed well if you mash it . ▢ If using pressure cooker you may need to cook it any where for 3 to 5 whistles depending on the brand of cooker. When the pressure releases, open the lid., ▢ Heat ghee or oil in a pan. Add cumin and red chili. Saute until cumin begins to splutter.▢ Add hing, green chilies and onions. Saute very well until the onions turn lightly golden.▢ Next ginger or ginger garlic paste. Saute for 30 to 60 seconds until it turns aromatic.▢ Add tomatoes, salt and turmeric. Saute and cook until the tomatoes turn soft.▢ Next add chili powder and garam masala. ▢ Saute for 1 to 2 mins. Make sure raw smell of all the ingredients has gone completely & the masala smells good.▢ Add chana dal along with the left over stock or water in the pot/ cooker.▢ Mix everything well and if needed add little water to bring it to a consistency you like.▢ Lightly mash the dal with the spatula to get a thick consistency. Cook until the chana dal begins to bubble well. Do not overcook.▢ Add crushed kasuri methi and amchur powder (optional).▢ Stir and turn off the stove. Add some coriander leaves & squeeze in some lemon juice.▢ Transfer chana dal to a serving bowl. Serve with rice, ghee, papad or a veg salad., ▢ Pour oil to the steel insert and press saute button. Once the oil is slightly hot, add cumin seeds. As soon as they splutter, add hing, green chilli and onions.▢ Stir fry until transparent for 2 mins. Add ginger garlic and saute for 30 seconds. Stir in the tomatoes, salt, turmeric, red chilli powder and garam masala. ▢ Saute for 2 to 3 mins and add the chana dal. Pour water and deglaze the pot by scrubbing the bottom of the steel pot with a spatula.▢ Secure the instant pot with the lid and position the steel release handle to sealing. Press pressure cook button and set the timer to 13 minutes.▢ When the pressure drops open the lid and check. Chana dal should be soft cooked yet holding its shape. If you want a slightly consistency, you may mash some of the lentils with the back of the spoon.▢ Stir in crushed kasuri methi. If you want you can also add half teaspoon amchur, more salt and garam masala at this stage. If the lentils are runny, simmer for a few more minutes. If you like it runny, add some boiling hot water and cook on a saute mode for 1 to 2 minutes.▢ Turn off when the chana dal is still runny as it thickens upon cooling. Squeeze some lemon juice and garnish with coriander leaves."
    },
    {
        "Title": "Green Moong Dal (Green Gram Dal)",
        "Ingredients": "▢ ½ cup green gram (dried whole green moong, mung beans)▢ ½ cup onions fine chopped (1 medium)▢ ¾ cup tomatoes deseeded & chopped or pureed (1 large)▢ 1 green chili  chopped (optional)▢ ¾ teaspoon ginger minced or paste (¾ inch)▢ 2 to 3 garlic cloves minced (or ¾ teaspoon paste)▢ 1 sprig  curry leaves or bay leaf▢ 1½ to 2 tablespoons oil or ghee▢ ½ teaspoon cumin seeds (jeera)▢ ¼ teaspoon mustard seeds  (optional)▢ ½ to ¾ teaspoon Kashmiri red chili powder (adjust to taste)▢ ½ teaspoon garam masala▢ ¾ teaspoon coriander powder▢ ¼ teaspoon turmeric▢ ¾ teaspoon salt (adjust to taste)▢ 1½ cups water (3 cups for pot) (1½ cups for Instant pot)▢ 2 tablespoon coriander leaves to garnish",
        "Instructions": "▢ Rinse and soak green gram for 3 to 4 hours. Avoid over soaking as the skin begins to separate on its own while cooking.  Once soaked, discard the water and rinse them well.▢ Heat a pan or pot or pressure cooker with oil. Add mustard seeds (optional) & cumin seeds. ▢ When they begins to splutter, fry curry leaves & green chilies for 1 minute. ▢ Add onions & saute until golden. Add the ginger garlic & fry for a minute.▢ Next add tomatoes & saute until they break down and turn mushy▢ Stir in red chili powder, garam masala & coriander powder. Saute for about 1 to 2 minutes.▢ Add the green gram and pour water.▢ If cooking in a pot: Cook till the green gram is tender & soft.  Add more hot water if required, as you cook. ▢ If using a pressure cooker, cook on a medium heat for 3 whistles. When the pressure releases, open the lid.▢ If the curry is runny, mash the green moong dal a bit and cook further for a while until it becomes thick.▢ Pour a teaspoon of ghee before serving. Squeeze in some lemon juice. Garnish with coriander leaves. Serve with rice or chapati., ▢ Rinse the green moong dal well and keep immersed in fresh water until you prepare the ingredients. Press saute button on your Instant pot and wait for the display to show “HOT”.▢ Pour oil or ghee. Add cumin seeds, curry leaves, onions and green chili.▢ Saute until the onions turn light golden. Stir in the ginger garlic & saute for 30 to 60 seconds.▢ Add tomatoes and sprinkle salt. Saute until the tomatoes turn soft and mushy.▢ Add chilli powder, garam masala, coriander powder & turmeric.  Saute for 30 seconds & press cancel button.▢ Pour water and mix well at the bottom of the steel insert to deglaze any bits of food stuck. At this stage if you desire you can also blend the onion tomato masala using a hand blender.▢ Drain water from the green gram and add them. (Optional for cooking rice – Place a trivet and then the rice bowl. Cover the rice bowl.)▢ Secure the IP with the lid and position the steam release handle to sealing.▢ Press pressure cook button and set the timer to 12 mins. If using dried mung beans (unsoaked) then cook them for 15 mins.▢ Let the pressure release naturally for 10 mins, then release the rest manually.▢ Garnish green gram dal with coriander leaves. You can also stir in some coconut milk or lemon juice if you want."
    },
    {
        "Title": "Moong Dal Recipe",
        "Ingredients": "▢ ½ cup moong dal (yellow mung lentils)▢ ¼ cup (1 small)  onions (fine chopped)▢ ½ cup (1 large)  tomatoes  (deseeded & chopped)▢ 1 tablespoon oil  or ghee▢ ½ teaspoon cumin seeds▢ 1 teaspoon ginger  (peeled & fine chopped)▢ 1 green chili  (slit or chopped, deseeded if required)▢ 4 to 5 curry leaves (or 1 bay leaf)▢ ⅛ teaspoon turmeric▢ ¼ teaspoon Kashmiri red chilli powder▢ ½ teaspoon garam masala▢ 1¾ to 2 cups water▢ 1 teaspoon kasuri methi  (dried fenugreek leaves, optional), ▢ 1 tablespoon ghee  or oil or butter▢ 2 to 3 garlic cloves crushed ▢ 1 dried red chilli▢ ¼ teaspoon mustard seeds  (optional)▢ ½ teaspoon cumin seeds▢ 6 to 8 curry leaves  (optional)▢ ⅛ teaspoon hing  (asafoetida, optional)▢ ¼ teaspoon red chilli powder, ▢ ½ cup moong dal  (or skinned split green gram)▢ 1½ cups water (same for IP), ▢ 1 tablespoon oil (or ghee or butter)▢ 1 dried red chili (broken & deseeded if required)▢ ½ teaspoon cumin seeds ( jeera)▢ ¼ teaspoon mustard seeds (optional)▢ 1 pinch asafoetida (hing) (skip if you don't have)▢ 1 sprig  curry leaves or bay leaf (optional)▢ 1  green chilies chopped (deseeded for low heat, optional)▢ 1  teaspoon garlic fine chopped▢ 1 teaspoon ginger fine chopped, ▢ ⅛ teaspoon turmeric▢ ¼ teaspoon red chilli powder▢ ¼ to ½ teaspoon garam masala, ▢ 1 small  onion (¼ cup chopped)▢ 1 large  tomato (½ cup chopped, deseeded if required)▢ ½ to ¾ teaspoon salt (adjust to taste)▢ ½ teaspoon crushed kasuri methi (dry fenugreek leaves) (optional)▢ ¼ to ¾ cup water (more or less for consistency) ▢ 2 tablespoon coriander leaves (cilantro finely chopped)▢ 1 tablespoon lemon juice (or ½ tsp amchur or dry mango powder) as needed",
        "Instructions": "▢ Add moong dal to a bowl and rinse it well and drain the water. Repeat rinsing a few times until the water runs clear. Let soak until you prepare the rest.▢ Chop onions, tomatoes, green chilies and ginger., ▢ Pour 1 tablespoon oil to a pressure cooker. When the oil becomes slightly hot, add cumin seeds. When the seeds splutter, add ginger, green chilies and 4 to 5 curry leaves.▢ Fry until aromatic for about a minute and add onions. Saute them until transparent or pink, for 2 to 3 mins.▢ Add tomatoes and salt. Saute for 1 to 2 mins. Stir in turmeric, red chilli powder and garam masala. To bring out the flavors, optionally saute for 1 to 2 mins.▢ Drain the water from the moong dal and add the lentils here. Pour water and mix well to deglaze the bottom of the cooker.▢ Cover and pressure cook for 4 to 5 whistles on a medium flame. ▢ When the pressure drops, open the lid and add kasuri methi. If you prefer you can mash the moong dal a bit. Taste test and add more salt if required.▢ Moong dal is ready at this stage and you can serve it as is. For extra flavour you may proceed to the next steps., ▢ Heat 1 tablespoon ghee in a small pan, on a medium flame. Add the crushed garlic and dried red chillies. Let the garlic fry a bit but not brown.▢ Turn down the heat to low and add mustard seeds, cumin seeds and curry leaves. Turn off the heat and stir in red chilli powder and hing.▢ Pour this over the moong dal and mix gently. When the dal cools down a bit squeeze some lemon juice and serve., ▢ Pour oil or ghee to the steel insert of the Instant pot and press the saute button. When the oil turns slightly hot, add cumin seeds & curry leaves or bay leaf, followed by ginger, green chilies and onions. ▢ Saute onions for 1 to 2 mins. Stir in turmeric, red chilli powder & garam masala. Press Cancel. Add tomatoes, moong dal & pour water. Deglaze the pot well.▢ Optionally if you want, you may place a long legged trivet and place your rice bowl over that. You will use only short grain rice here. The cook time for basmati won’t match.▢ Secure the IP with the lid and position the steam release valve to sealing. Press the pressure cook button and set the timer to 10 minutes. ▢ Let pressure drop naturally. Open the lid, add kasuri methi & give a good stir. Taste test and adjust salt. If the consistency is too thick, you may pour some boiling hot water and mix.▢ Though you can serve the moong dal at this stage, since this recipe is for a moong dal tadka, make an additional tadka (next step). ▢ Heat ghee in a small pan on a medium heat. Add crushed garlic cloves and red chilies. When the garlic begins to smell good, add mustard seeds, cumin seeds and curry leaves (optional). ▢ Turn off the stove and stir in red chilli powder and hing (optional). Pour this all over the Instant pot moong dal. Before serving give a gentle mix and add some coriander leaves. Squeeze in some lemon juice., ▢ Rinse moong dal thrice in a pot or pressure cooker with ample amount of water.  Drain the water completely. Pour water., ▢ Option 1 – To cook in a pot: Bring the water to a rolling boil and reduce the heat to medium. Cook uncovered until moong dal is soft and completely cooked. Discard any froth that comes on top. If required add more hot water as you cook.▢ Option 2 – To cook in a Pressure cooker: Pressure cook for 3 to 4  whistles on a medium heat. If cooking in a instant pot – Place the bowl inside the instant pot, secure the lid & cook for 10 mins on a high pressure.▢ Once the pressure releases, open the lid and check. Moong dal must be soft cooked. If you like smooth & creamy dal then mash it well., ▢ Pour ghee or oil to a hot pan. Add mustard, cumin & red chili. Let them pop. ▢ Next add green chilies, ginger garlic & curry leaves. Fry until a nice flavor comes out. ▢ Then saute onions until transparent. Next saute tomatoes until soft & mushy.▢ Add turmeric, salt, garam masala and chilli powder. Saute for a min until aromatic. ▢ Pour half cup water and bring it to a boil. Then transfer cooked dal. Pour more water if needed to bring to a desired consistency. ▢ Dal is usually made to a thick but of pouring consistency. It turns thick upon cooling.▢ Stir and cook till it begins to bubble. Optional – Add kasuri methi and amchur if using. Stir and switch off.▢ Squeeze in some lemon juice when it cools down a bit. Serve moong dal with rice, roti or any Indian bread., ▢ Press the SAUTE button on your Instant pot.▢ Pour ghee or oil to the inner pot. Add cumin,mustard, dried red chilli and curry leaves or bay leaf. ▢ When they splutter, add asafoetida (hing), onions and green chilies. Fry for about 2 mins until the onions turn transparent.▢ Then add in ginger, garlic, red chili powder, garam masala and turmeric. Give a quick stir.▢ Add in tomatoes, salt, rinsed dal and pour 1½ cups water.▢ Deglaze the inner pot by scrubbing with a spatula to release any bits of food stuck.▢ optional – Place a trivet and place your rice bowl.▢ Secure the IP with the lid. Position the steam release handle to sealing. Press PRESSURE COOK  button and set the timer to 10 mins.▢ When the IP is done, press cancel and switch off. Wait for the pressure to release naturally for 10 mins.▢ Release the rest of the pressure manually. With the help of a spoon, gently move the steam release handle from sealing to venting. This releases the steam.▢ Sprinkle kasuri methi over the dal and mash it if you like it smooth. If the dal is too thick you can pour ¼ to ½ cup hot water and bring it to consistency. Taste it and add more salt if needed.▢ Garnish moong dal with coriander leaves and squeeze in lemon juice."
    },
    {
        "Title": "Sambar Recipe, How to Make Sambar",
        "Ingredients": "▢ ¾ cup toor dal (split pigeon peas) (refer notes)▢ 2 cups water to cook dal▢ 1 to 2 tablespoon tamarind  or tamarind paste as needed▢ 1 tablespoon jaggery (optional)▢ ¾ tablespoon salt (adjust to taste)▢ ¼ teaspoon turmeric (skip if your sambar powder has it)▢ ½ to ¾ teaspoon red chilli powder (optional)(notes)▢ ¼ cup coriander leaves chopped, ▢ 1 medium onion diced (or 12 to 15 shallots)  (150 grams)▢ 1  large tomato (100 grams) ▢ 1 medium carrot diced (optional)▢ 1 to 2 vegetable drumsticks (8 to 10 pieces, moringa (100 grams))▢ 2 to 3 bhindi (okra, optional (50 grams))▢ 1 green chili slit (optional), ▢ 1 tablespoon ghee  or oil▢ 1 sprig curry leaves▢ ½ teaspoon cumin seeds optional▢ ½ teaspoon mustard seeds▢ 1 Pinch methi seeds (fenugreek seeds)▢ ⅛ teaspoon asafoetida (hing)▢ 1 to 2 dried red chili (optional), ▢ 1 tablespoon coriander seeds▢ 1 tablespoon chana dal (skinned split bengal gram)▢ 1 teaspoon urad dal (skinned split black gram)▢ ¼ to ½ teaspoon methi seeds  (fenugreek seeds)▢ ½ teaspoon cumin seeds (jeera)▢ 4 to 5 dried red chilies  (kashmiri or byadgi) (less spicy variety)",
        "Instructions": "▢ Wash toor dal a few times in cooker or pot until the water runs clear.▢ Pour 2 cups water & pressure cook for 2 to 4 whistles depending on the brand of cooker.  If cooking in Instant pot, press the pressure cook button & set the timer for 9 mins. If you do not have a pressure cooker, it can be cooked in a pot until soft adding more water as needed.▢ Rinse all the veggies. Scrape the drumsticks lightly & rinse. Chop them to 2 inch pieces. Peel the shallots as well & rinse. ▢ Dice tomatoes & chop okra to 1 inch pieces. If using pumpkin, peel the skin & dice. Keep all these aside., ▢ While the dal cooks, make the sambar powder. Dry roast red chilies, urad dal and chana dal until golden & crunchy. Add coriander seeds & fry till aromatic. Remove to a plate.  ▢ Next add methi seeds and saute until slightly dark. Then add cumin, fry for a minute. Cool these and powder finely in a spice jar., ▢ Heat 1 tsp oil in a pot. Saute onions for 1 minute. Add all the veggies & saute for 2 mins. This saute step can be skipped but sometimes onions, tomatoes and chilli powder don't smell good when boiled without sautéing.▢ Stir in the chilli powder (optional) and pour 4 to 5 cups of water. [Use 4 cups is using only toor dal and 5 cups if using some moong dal as well.]▢ When the water turns hot, take ¼ cup hot water with a ladle to a bowl. Add tamarind & jaggery (optional). Set aside to soak.▢ When the veggies are cooked al dente, add turmeric, sambar powder & salt. Squeeze the tamarind and pour the tamarind water. I prefer to filter the tamarind water while pouring.▢ Cook for 3 to 5 minutes. When the pressure releases, mash the dal to smooth with a masher or ladle.▢ Stir it to the boiling sambar. Adjust salt and tamarind if needed. Bring it to a gentle boil and add coriander leaves., ▢ Heat a small pan with ghee. Add mustard, cumin, methi & red chillies. When the spices pop, add curry leaves.▢ The leaves will turn crisp, then add hing & pour this to the simmering sambar.▢ Serve sambar with rice, idli, vada or dosa., ▢ Set aside the desired portion to refrigerate in smaller containers.▢ Cool completely and refrigerate immediately. To retain the taste of sambar, refrigerate within two hours of cooking. ▢ It keeps good for about 2 to 4 days. Bring it to a boil & make a fresh tempering."
    },
    {
        "Title": "Masala Dosa Recipe",
        "Ingredients": "▢ ½ cup urad dal (skinned black gram)▢ 3 tablespoon chana dal  (bengal gram) (or 2 tbsps chana dal & 1 tbsp toor dal)▢ 1½ cup raw sona masuri rice (refer notes)▢ ½ cup idli rice  (optional, can skip or substitute with raw rice) ▢ 3 tablespoon poha (flattened rice)▢ ½ teaspoon methi seeds (fenugreek seeds)▢ ¾ teaspoon pink salt or non-iodized salt (or as needed)▢ 1¼ cups water to blend dal (adjust if needed)▢ ½ to ¾ cups water to blend rice (refer notes), ▢ 2 cups potatoes cubed (500 grams or 3 medium)▢ 1 tablespoon oil▢ ¼ to ½ teaspoon mustard seeds▢ ½ teaspoon cumin  (jeera)▢ 1 teaspoon chana dal (bengal gram) (optional)▢ 1 teaspoon urad dal (skinned black gram) (optional)▢ 1 pinch asafoetida  (hing)(optional)▢ 1 teaspoon ginger  (grated or paste)▢ ¾ to 1 cup onions thinly sliced ▢ 1 sprig  curry leaves▢ 2 green chilies chopped or sliced▢ ¼ teaspoon turmeric (haldi)▢ ½ to ¾ teaspoon salt  (adjust to taste)▢ 2 tablespoon coriander leaves finely chopped, ▢ Butter as needed  (preferably unsalted cultured butter)",
        "Instructions": "▢ Add urad dal, chana dal and methi seeds to a large bowl. Rinse them well a few times and pour lots of fresh water. To another large bowl, add rice and rinse it well few times. Pour lots of fresh water. ▢ Soak for 4 to 5 hours. 30 mins before you begin to make the batter, rinse poha twice. Pour water enough to immerse it fully. Soak it for 30 mins.▢ Later drain the water from the dal completely and add to a blender jar along with poha. ▢ Pour 1¼ cup water and salt. If you live in a hot weather then skip salt now and add after fermentation.▢ Blend the batter well until thick, frothy and smooth. While you blend ensure your blender doesn't heat up and get overloaded. So give a break in between and blend.▢ Transfer the batter to the bowl in which you soaked the dal. ▢ Drain the water from rice completely and add it along with ½ cup water to the blender jar. ▢ Blend slightly coarse or smooth to suit your liking. I make a slightly coarse batter of fine semolina texture. If needed pour the rest of the ¼ cup water while blending. I use up full 2 cups water mentioned in the recipe to blend.▢ Pour this rice batter to the dal batter & mix well. You can check the video or step by step photos to know the consistency of batter.▢ I divide the batter to 2 large bowls. You can do the same if you prefer to use it on 2 different days. Cover the bowl., ▢ Allow the masala dosa batter to ferment in a warm place for about 6 to 16 hours depending on your weather. The batter has to rise and turn slightly fluffy. Do not over ferment the batter.▢ If you live in a cold place, then preheat the oven to 60 C or 140 F for 10 mins.  Keep the batter inside with the oven light ON.  Or You can also use your instant pot in the yogurt settings., ▢ Boil or steam potatoes until just done. Do not cook them until very mushy.▢ Instant pot: You can pressure cook the potatoes in your IP following these timings – 5 mins if using small potatoes, 6 to 7 mins if using medium ones and 10 mins if using large potatoes. ▢ Pressure cooking: If using a pressure cooker, then add peeled and diced potatoes to a bowl and pour water to partially cover them. Place it in the pressure cooker and let it whistle thrice.▢ While the potatoes boil, soak 1 teaspoon chana dal and 1 teaspoon urad dal in little hot water so they soften. After 30 mins drain the water from the dal and keep aside. When the pressure releases, remove the potatoes.▢ Heat a pan with oil. Then add cumin, mustard, chana dal and urad dal. Saute until the dals turns golden. ▢ Then add onions, curry leaves and chilies. Fry until the onions turn lightly golden.▢ Add hing and ginger. Fry until the aroma of ginger comes out.▢ Crumble the potatoes and add them to the pan. Add turmeric and salt along with 2 to 3 tbsps of water. Skip pouring water if your potatoes are too moist or lightly mushy.▢ Saute for 2 to 3 mins. Add coriander leaves. Taste and add more salt if needed. Set this aside., ▢ Bring the batter to consistency by adding little water. It must be of thick pouring and spreading consistency. ▢ Heat your dosa tawa on a medium heat. If using cast iron pan, when it turns slightly hot, drizzle few drops of oil on it. Insert a fork or a butter knife into a cut onion and rub the oil all over the pan. If using cast iron griddle, you can also season it the previous night.▢ Check if your pan is hot enough by sprinkling little water on it. It is hot enough it will sizzle and the water evaporates. This tip is only for cast iron pan. Do not try this on a non-stick. ▢ When the pan is hot enough, stir your batter once and take a ladle full of it. ▢ Pour it in the center of the hot tawa. Immediately begin to spread it in a circular motion starting from the center, keep moving your hand in clockwise direction, making circles until you reach the edges of the pan. Refer video or check images below.▢ You can make thick or thin dosas as per your desire. If you are unable to spread the batter, it means the batter is too thick or the pan is too hot. Check the troubleshooting tips above.▢ Pour about half tsp oil or spread ¼ tsp soft butter around the edges & a little here and there.▢ Cook the masla dosa on a medium heat. Within few minutes, you can see the edges leave the pan. Flip and cook just for 1 minute.▢ Flip it back and cook until the base turns golden and crisp. If making mysore masala dosa, smear the red chutney (recipe below) as desired. Place the curry in one half of the dosa. Fold it or roll it.▢ To make the next dosa, if using cast iron pan repeat the process of rubbing with cut onion. Make sure the tawa is hot enough and not over hot otherwise it will burn the dosa. Do not cook the dosa on low heat as it makes the dosa hard.▢ Serve crispy masala dosa hot with coconut chutney and tiffin sambar., ▢ Roast 2 tbsps chana dal until golden along with 6 to 8 dried red chilies. Chilies have to turn crisp.▢ Saute 1 large onions lightly in 1 tsp oil until the raw smell goes off. Add 2 pinches of cumin.▢ Cool everything. Powder the dal and chilies first.▢ Add half tsp tamarind (optional), 2 garlic cloves and salt. Blend till smooth. You will have a thick chutney. If the chutney turns very thick, add 1 to 2 tbsps of water and blend again."
    },
    {
        "Title": "32 Oats Recipes for Breakfast & Snack",
        "Ingredients": "▢ 1 cup rolled oats▢ ½ cup moong dal (skinned split mung lentils)▢ 2 to 2½ cups water (4 cups for instant pot)▢ 8 to 10 cashews▢ ½ teaspoon black pepper corn (crushed, adjust to taste)▢ ½ teaspoon salt (more to adjust)▢ 1 sprig curry leaves▢ 1 teaspoon ginger grated or fine minced▢ ⅛ teaspoon turmeric▢ ½ teaspoon cumin seeds▢ 2 tablespoon ghee  or as needed▢ ⅛ teaspoon hing (asafoetida)▢ 1 green chilli slit (optional)",
        "Instructions": "▢ Dry roast oats in a pot or pressure cooker for 3 to 4 minutes and remove them to a bowl. This step helps to make less sticky oats pongal.▢ To the same pot or cooker, add moong dal and dry roast for 5 to 6 minutes on a medium heat until aromatic. This makes your oats pongal aromatic.▢ Pour water and rinse the dal well at least thrice. Pour 1½ cups water and pressure cook for 3 whistles. If cooking in a pot, cook until moong dal becomes soft and mushy. If needed add more water while you cook.▢ Once the pressure releases, open the lid and check. Dal has to be soft cooked. Pour ¾ to 1 cup hot water and add roasted oats.▢ Cover and cook on a low to medium heat until oats are softened. Rolled oats do not take too long to cook as they are pre-steamed.▢ Add salt as required and taste test it to adjust.▢ Heat a pan with ghee. Add ginger and green chilli (optional). Saute for 30 to 40 seconds, then add cumin seeds, cashew nuts, curry leaves and black pepper. ▢ Fry until the cashews become light golden. Then add hing and turmeric. Turn off the stove.▢ Pour the tempering to the cooked oats and moong dal. Stir and cover for 5 minutes before serving., ▢ Press the saute button and add ghee to the steel insert. Fry the cashews until golden and remove them to a bowl for garnishing later.▢ Add ginger, green chilies (optional), cumin seeds, black pepper and curry leaves. Saute until you begin to smell the curry leaves good.▢ Then add hing and oats. Roast for 2 to 3 mins. If the IP becomes too hot, press cancel in between and continue.▢ Add rinsed moong dal, turmeric and salt. Continue to sauté for 4 to 5 minutes. I found this step makes the dish aromatic and less sticky.▢ Press cancel. Pour 4 cups water and deglaze the pot.▢ Secure the instant pot with the lid. Press pressure cook and set the timer to 8 minutes.▢ After the IP beeps, wait for natural pressure release for 8 minutes. Release the rest of the pressure manually.▢ Stir oats pongal. I prefer to top with little ghee. Serve with papads, pickle or chutney."
    },
    {
        "Title": "Medu Vada Recipe (Garelu)",
        "Ingredients": "▢ 1 cup urad dal (or skinned black gram)▢ ⅓ teaspoon salt (adjust to taste)▢ Ice cold water▢ Oil  for deep frying, ▢ ¼ to ½ teaspoon pepper corn  (crushed coarsely)▢ 2 to 3 green chilies (chopped)▢ 4 tablespoon onions (chopped) (1 small)▢ 1 sprig curry leaves (chopped)▢ ½ teaspoon cumin seeds (jeera)▢ 1 teaspoon ginger fine grated",
        "Instructions": "▢ Wash dal several times and soak in lot of water for at least 4 to 5 hrs.▢ Drain the water completely and transfer the dal to a mixer grinder jar. If you have a wet grinder, you can use it. ▢ Sprinkle 3 tablespoons water. Next add salt and start grinding.▢ Next scrape off the sides and then grind again. Whenever needed sprinkle only as much as 1 ½ tsps. Ice cold water evenly. ▢ Again continue to grind to a coarse thick batter. Ensure your grinder does not become hot.▢ Sprinkle water. Grind again till the batter looks fluffy and white.▢ Transfer this to a bowl. Aerate the batter by beating it with your hand in a clockwise direction for 30 to 60 seconds.▢ Test the batter if it is aerated well.  Drop a small batter ball in bowl full of water. The ball has to float meaning it is light. This is needed to get fluffy medu vada.▢ If the batter doesn’t float well, means either the batter is runny or is not aerated well. Read the notes below to know what to do with runny batter. ▢ If the batter is in right consistency still it is not floating well. Then beat the batter once more. ▢ Add crushed pepper, cumin, ginger,scurry leaves, green chilies and onions. Mix everything well., ▢ Heat oil in a deep heavy bottom kadai or pan on a medium heat till hot enough. ▢ Drop a small amount of batter to check if the oil is hot. The batter raises if the oil is hot enough.▢ Dip your fingers in water or oil to moisten your fingers. Water should not be dripping.▢ Take small portions of batter.  Shape to a ball, slightly flatten with thumb. ▢ Dip the thumb in water, again no dripping water. Make a hole in the center. ▢ Gently slide the vada in the hot oil by gently shaking off the fingers.▢ Or place the ball on a greased sheet. Flatten it slightly and make a hole in the centre.▢ If the oil becomes too hot, regulate the flame to medium. ▢ Moisten your fingers again. Lift the corner part of the sheet and transfer the vada on to your fingers. Then drop it just by shaking your fingers.▢ Fry medu vada till they turn golden on both sides.▢ Make them and fry them in batches till you use up all the batter. In between every batch, wait till the oil heats up, if not hot.▢ Serve medu vada with coconut chutney or tiffin sambar."
    },
    {
        "Title": "Poori Recipe, How to make Puri",
        "Ingredients": "▢ 1 cup wheat flour (atta)▢ ¾ teaspoon semolina (fine rava or chiroti rava) (optional)▢ ¾ teaspoon oil (or ghee)▢ ¼ cup water (plus 1 to 2 tbsp) (adjust as needed)▢ ⅛ teaspoon salt (adjust to taste)▢ oil (for deep frying)",
        "Instructions": "▢ Mix together flour, salt, rava and oil in a large mixing bowl. ▢ Pour ¼ cup water. Begin to make a little stiff & tight dough, adding more water as needed. (check video)▢ Smear ½ tsp oil, knead lightly and smoothen the ball.▢ Do not knead it a lot otherwise poori will turn soft and absorb oil while frying. ▢ Keep the dough covered all the time until the last poori is rolled. Do not rest the dough for more than 3 to 5 minutes. The longer it rests quicker the puffed puri will collapse. They will turn oily after frying.▢ Divide the dough to 8 to 10 portions. Avoid kneading them. ▢ Smoothen all the balls by rolling them lightly in between your palms. Keep them covered in the bowl., ▢ Drizzle a few drops of oil on the rolling area and spread it. ▢ Smear oil over the dough ball & flatten it.▢ Begin to roll it evenly from the center to a round puri.▢  It should not be too thick or thin. It must be moderately thick which helps the puri to puff.▢ Make 5 to 6 puris and set them aside. Do not stack them.▢ Begin to heat the oil on a medium high flame and continue to make rest of the pooris., ▢ The oil has to be hot enough. Check by dropping a small portion of dough to the pan. It has to rise immediately without browning. ▢ If it browns quickly then reduce the flame slightly and allow the temperature to come down.▢ Slide the puri carefully to the hot oil. Do not disturb until it rises half way to the surface.▢ Quickly but gently begin to press down with a perforated ladle. This helps the poori to puff well.▢ Once puri puffs, flip it carefully. Fry on the other side as well until golden and crisp. ▢ You can fry flipping too and fro once more until slightly crisp & to get the desired color – light golden to dark golden.▢ Remove the puri to a steel colander. Fry the next poori the same way. ▢ Make sure the oil is hot enough, but not smoking before frying the next puri. Serve poori with potato curry, chutney or kurma."
    },
    {
        "Title": "Rava Idli Recipe | Instant Idli with Suji",
        "Ingredients": "▢ 1 cup semolina or bombay rava or suji or chiroti rava▢ 2 tablespoon ghee  or clarified butter▢ ½ teaspoon mustard seeds▢ ¼ teaspoon cumin  or jeera▢ ½ tablespoon chana dal  or bengal gram▢ 1 tablespoon cashews chopped (optional)▢ 10 curry leaves▢ 2 green chilies  chopped (skip for kids)▢ ¾ tsp ginger grated or paste, ▢ 1/3 teaspoon salt  – use as needed▢ 2 to 3 tablespoon coriander leaves chopped finely▢ ¾ cup curd or yogurt or dahi (fresh, not sour)▢ ½ cup water for soaking rava▢ 2 to 3 tablespoon water for batter consistency▢ 1 teaspoon lemon juice (skip if using eno)▢ 1 teaspoon Eno or fruit salt or ¼ tsp cooking soda (or soda-bicarbonate) (* refer notes)▢ 1 teaspoon oil  for greasing idli plates▢ 4 cashewnuts  or 8 split cashews▢ 1 teaspoon carrot  grated",
        "Instructions": "▢ Heat 2 tablespoons ghee in a pan. ▢ Fry 8 split cashews until golden and set aside for garnishing.▢ To the same pan add ½ teaspoon mustard, ¼ teaspoon cumin, 1 tablespoon broken cashews and ½ tablespoon chana dal. ▢ Fry until the dal turns golden.▢ Reduce the flame and add 10 curry leaves, 1 to 2 chopped green chilies and ¾ teaspoon ginger. ▢ Saute until it turns fragrant just for 30 seconds.▢ Then quickly add 1 cup rava. ▢ Mix well to coat the semolina with ghee. ▢ Roast on a low flame stirring consistently until the rava turns crunchy and slightly aromatic. ▢ Do not brown the rava. Set this aside and cool completely., ▢ When the rava is cooled down completely, add salt, 2 to 3 tablespoons coriander leaves, ¾ cup curd and half cup water. ▢ Mix well until the batter is uniform. Cover this and set aside for 30 mins.▢ After 25 mins, grease the plates and place a cashew in each of the moulds.▢ Also sprinkle some carrots. Set this aside., ▢ Bring water to a boil in a steamer or cooker.▢ When the water is just about to come to a boil in a few minutes, Check the consistency of the batter and pour more water if needed. ▢ The batter has to be thick like regular idli batter and must be smooth. ▢ When you drop it with the spoon it should not be lumpy.▢  It should not be of pouring consistency either.▢ Skip this step if using eno. ▢ Add 1 tsp lemon juice to the batter and give a quick stir.▢ Then sprinkle eno or soda and gently give a good mix. ▢ Avoid over mixing. The batter needs to be steamed immediately otherwise the rava idli will not turn fluffy & soft.▢ Immediately transfer the batter to moulds. ▢ Place it in the hot steamer and steam for 10 mins on a high flame. ▢ Allow the idlis to cool down for 2 mins.▢ If the rava idli is properly done, then a skewer or fork inserted into it comes out clean or with little crumbs. ▢ When the rava idlis cool down for about 3 to 4 mins, demould them with a wet spoon. ▢ Serve rava idli with coconut chutney or potato sagu (recipe below)."
    },
    {
        "Title": "35 Sandwich Recipes",
        "Ingredients": "",
        "Instructions": ""
    },
    {
        "Title": "Tomato Soup Recipe",
        "Ingredients": "▢ 500 grams (1.1 lbs) Tomatoes (ripe red tomatoes) cubed▢ 1 tablespoon olive oil or butter▢ 1 small bay leaf▢ 1 medium onion cubed▢ 2 large garlic cloves▢ ⅓ teaspoon Salt or as needed▢ 1½ cup water (or stock) more if needed▢ 1 tablespoon sugar▢ ¾  tablespoon corn starch (corn flour or arrowroot powder or 1 small boiled potato)▢ ½ teaspoon pepper or as desired▢ ¾ to 1 teaspoon dried herbs (I use mixed Italian herbs)▢ 2 stalks Basil (optional)▢ 2 tablespoon cream (or 25 cashew nuts)▢ 1 small carrot (optional) (diced)",
        "Instructions": "▢ Heat oil in a pan. Add bay leaf, garlic and onions. Saute all of these on a high flame for 3 to 4 mins. ▢ Then add in tomatoes and salt. Stir and cook until soft. ▢ Next add in basil and cook until tomatoes turn completely mushy. Turn off and cool., ▢ Discard the basil & bay leaf. ▢ Add the mushy tomato mixture along with the juices to a blender jar. ▢ Pour 1 cup water or stock and blend smooth.▢ Place a sieve over a pot & transfer the blended tomato soup to it. ▢ Filter and discard the leftovers. Bring it to a boil on a medium heat & simmer for 2 to 3 mins. ▢ Meanwhile stir in corn starch in half cup water and add it gradually to the boiling tomato soup.▢ Stir constantly and boil until slightly thick. ▢ Add sugar & more salt if desired. Simmer until it reaches a desired consistency.▢ Next add herbs & pepper. Cover the soup & turn off the stove. ▢ Allow it to cool down a bit before adding the cream. If you prefer to use cashew nuts, soak them in ¼ cup hot water for 30 minutes. Add them to a small chutney grinder along with the soaked water and puree until you get a thick and smooth cream. If needed add a few tablespoons more water for consistency. Use this to top your tomato soup while serving.▢ Transfer tomato soup to serving bowls. Garnish with herbs & cream. Enjoy with croutons., ▢ Spread butter on the bread slices and toast them on a medium heat until crisp. ▢ Then cut them to bite sized pieces."
    },
    {
        "Title": "Masala Pasta Recipe (Indian Style Pasta)",
        "Ingredients": "▢ 1½ cups  (120 grams, 4 oz) Penne Pasta (or any other of choice)▢ 2 to 2½ tablespoon olive oil  or (1½ oil & 1 tbsp butter)▢ ½ teaspoon cumin seeds (jeera)▢ 2 to 3 cloves  garlic  (grated, minced or paste)▢ ½ inch ginger (optional – peeled & grated, minced or paste)▢ ½ to ¾ teaspoon salt  (+ 1 tsp for boiling pasta)▢ ½ teaspoon Kashmiri red chili powder (adjust to taste, use up to 1¼ tsp)▢ ⅛ teaspoon turmeric (optional)▢ ½ teaspoon garam masala (or pav bhaji masala/ meat masala/ kitchen king masala)▢ 1 tablespoon kasuri methi (dried fenugreek leaves or 1 teaspoon Italian herbs)▢ 1 to 1½ tablespoon tomato ketchup (optional or 2 tbsps passata or 1 teaspoon paste)▢ 2 to 3 tablespoon cream or ¼ cup grated cheese (optional)▢ 1 to 2 tablespoons coriander leaves fine chopped, ▢ ½ cup onions  (1 medium onion chopped finely)▢ 1¼ cup (120 grams) tomatoes  (chopped or pureed ) do not use sour tomatoes▢ ½ cup carrots chopped (1 medium, optional)▢ ¼ cup green peas (frozen or boiled, optional)▢ ¼ cup capsicum (bell pepper, chopped, optional)▢ 2 to 4 tablespoons sweet corn kernels or 3 baby corn sliced or chopped (optional)",
        "Instructions": "▢ In a large pot, bring 6 cups water to a rolling boil. Add one teaspoon salt, a few drops of oil (optional) and pasta. ▢ Cook till al dente on a medium flame. I suggest referring the instructions on the pack of pasta for the correct timings.  It takes 8 to 9 mins to cook penne.▢ While the pasta cooks, rinse and chop the veggies.▢ When the pasta is cooked to al dente, reserve ¾ cup pasta cooked water in a cup and drain the pasta off to a colander. Optionally if you want you may rinse them under running water., ▢ Heat oil & butter (optional) in a pan. When the oil turns hot, add cumin seeds & let them splutter.▢ Stir in the garlic and ginger & saute for a minute.▢ Add onions and sauté them on a medium high heat until they turn golden.▢ Add chopped veggies and fry for about 2 to 3 minutes. Stir in the ground spices & salt.▢ Time to add the tomatoes & the ketchup/ passata (optional). Mix well and cook on a medium heat until the tomatoes cook down and the raw flavor of tomatoes is gone. You will also see oil begins to separate from the masala & the veggies are cooked through. Else cover & cook on a low heat.▢ Pour ¼ to ½ cup pasta cooked water or plain water. Mix well & cook for a few minutes, until the sauce turns thick & saucy. (Do not over cook)▢ Stir in kasuri methi & cooked pasta. Taste test & adjust salt. Cover and cook on a medium heat for 2 to 3 mins, until the pasta turns hot & steaming. ▢ If you want you may stir in heavy cream or grated cheese.▢ Garnish masala pasta with coriander leaves. Serve hot."
    },
    {
        "Title": "Tomato Chutney Recipe",
        "Ingredients": "▢ 250 grams ripe tomatoes (2 to 3 tomatoes, ½ pound, refer notes)▢ 2 to 3 small garlic  (5 grams)▢ ⅓ inch ginger  (3 grams peeled ginger, optional, for flavor)▢ 3 to 4 dried red chilies  (5 grams, or ½ to ¾ teaspoon red chilli powder)▢ ⅛ teaspoon turmeric▢ ¼ teaspoon salt  (adjust to taste)▢ ½ teaspoon cumin seeds▢ 1 to 1¼ tablespoons oil  (divided ½ + ½ to ¾ to temper), ▢ 1 sprig  curry leaves▢ ⅛ teaspoon mustard seeds▢ 1 dried red chilli  broken▢ 1 to 2 small garlic cloves  (crushed)▢ ⅛ to ¼ teaspoon red chilli powder  (optional, adjust to taste)▢ 1 pinch hing  (asafetida, optional), ▢ 3 medium tomatoes  (1½ cups chopped)▢ 1 small onion (½ cup cubed, optional)▢ 1 tablespoon oil▢ 1 tablespoon chana dal (bengal gram) or 2 tbsp peanuts▢ ½ tablespoon urad dal (skinned black gram) (optional)▢ 4 to 6 dried red chilies or green chillies or ½ to ¾ tsp red chilli powder▢ 2 medium garlic cloves (or ½ inch ginger)▢ ½ teaspoon cumin seeds (jeera)▢ ½ to ¾ teaspoon salt  (adjust to taste)▢ ⅛ teaspoon turmeric, ▢ 1 teaspoon oil▢ ¼  teaspoon urad dal (skinned black gram) (optional)▢ 1 sprig curry leaves▢ ¼  teaspoon mustard seeds▢ 1 pinch asafoetida (hing)▢ 1 dried red chili (broken to 2)",
        "Instructions": "▢ Rinse the tomatoes well under running water and slice them.▢ Heat oil and add cumin seeds. When the seeds splutter, add dried red chilies and fry them on a medium heat until crisp.▢ Stir in the ginger (optional) and garlic. Fry them until they turn aromatic for about 1 minutes or a little longer. Don’t burn the ginger and garlic.▢ Add the sliced tomatoes, salt and turmeric. On a medium high heat cook until the tomatoes turn completely mushy. Keep stirring in between to prevent burning.▢ Turn off the stove when most of the juices have evaporated and the tomatoes develop a nice flavour., ▢ Cool this completely and add to a grinder and blend to a smooth puree. Taste test and adjust salt as required.▢ Wipe down the same pan with some kitchen tissues. Pour oil to the pan and heat it.▢ Reduce the heat and add the mustard seeds, red chilies and garlic. Let the garlic turn fragrant and red chilies crisp. Then add the curry leaves and fry until crisp.▢ Stir in the red chilli powder (optional, to make it more spicy) and quickly add the pureed tomato mixture.▢ Mix well and saute for 1 to 2 mins. If you prefer to store this tomato chutney for longer, about 3 weeks, saute for another 2 to 3 mins until it turns really hot.▢ Serve with breakfasts, snacks or even with plain rice. To preserve this for 3 to 4 weeks, cool it completely and transfer to clean dry glass jar. Refrigerate and scoop out only with dry spoons., ▢ On a medium flame, roast chana dal & urad dal (or peanuts) until aromatic & deep golden. ▢ Add half teaspoon cumin seeds & roast for a minute. Remove to a plate & set aside to cool completely.▢ Heat a pan with 1 tablespoon oil. Fry 4 to 6 red chilies until they turn crisp. ▢ Add 1 cubed onion & 2 garlic cloves. Fry them until a sweet aroma comes out from the onions. This takes about 3 to 5 mins. ▢ When the onions turn golden add 3 large chopped tomatoes, ¼ teaspoon salt & 1/8 teaspoon turmeric. ▢ Saute until soft & mushy. The raw smell of onions and tomatoes must go away completely.▢ Cool this completely. Powder the roasted lentils to a fine powder in a grinder. Add the onions and tomatoes, blend until smooth. ▢ Taste the chutney and add more salt if needed. You may need to pour little water if using peanuts. If you like thick chutney & the tomatoes are pulpy you can also skip water completely., ▢ If you are on a low fat diet you can also skip the tempering. Heat 1 tsp oil in a pan. ▢ Add ¼ tsp mustard seeds and ¼ tsp urad dal.▢ When the dal turns golden, fry 1 sprig curry leaves and 1 broken red chili till the leaves turn crisp. ▢ Add hing & onion tomato chutney to the pan and mix. Or pour this tempering to the tomato chutney. ▢ Serve with idli, dosa and pesarattu. You can also refrigerate the chutney & use."
    },
    {
        "Title": "Egg Curry Recipe",
        "Ingredients": "▢ 4 to 5 boiled eggs▢ 2 tablespoons oil▢ 1 teaspoon ghee or oil▢ 1¼ cups onions fine chopped or 2 medium onions diced, boiled & pureed▢ 1 cup tomatoes finely chopped or 3 medium tomatoes pureed▢ 1 green chilli (optional) chopped or slit▢ 1 teaspoon ginger garlic paste or finely minced ▢ ½ teaspoon salt  (adjust to taste)▢ 1 to 1 ¼ cup water (adjust slightly as needed)▢ 1 tablespoons coriander leaves chopped finely▢ ¼ teaspoon Kasuri methi (dried fenugreek leaves, optional)▢ ½ teaspoon sugar (optional)▢ 4 tablespoons cream or 10 cashews blended with ½ cup water (optional), ▢ 1 small  bay leaf ▢ 1 small cinnamon piece▢ 2 green cardamoms, ▢ ½ to 1 teaspoon red chilli powder▢ ½ to 1 teaspoon garam masala  (refer notes)▢ ½ to 1 teaspoon coriander powder (optional)▢ ⅛ teaspoon turmeric",
        "Instructions": "▢ Fine chop or puree the onions. If you prefer to puree the onions, first boil diced onions in 2 cups of water for 4 mins until transparent. Drain the water and puree them in a blender. ▢ Refer notes below to boil eggs perfectly. Wipe dry the boiled eggs or air dry until moist free. Prick each egg with a fork 2 to 3 times. We do this so the eggs don't splatter oil and burst in the pan while frying.▢ Heat 1 teaspoon ghee or oil in a nonstick pan & Fry the eggs until golden & slightly blistered. Remove the eggs to a plate & optionally sprinkle 2 to 3 pinches each of chilli powder & garam masala., ▢ Heat 2 tbsp oil and add bay leaf, cardamoms and cinnamon. ▢ When they begin to sizzle, add onions & green chilli. Saute onions until golden and the raw smell has almost gone.▢ Add ginger garlic paste and saute until the raw smell goes off, for about a minute. ▢ Then add tomatoes and saute well until the mixture turns mushy.▢ Next add red chili powder, garam masala, coriander powder, turmeric and salt.  Saute everything well until a  nice aroma comes out & the mixture leaves the sides of the pan.▢ Pour water 1 to 1¼ cups water and mix well. Cover and cook until the curry thickens and you see traces of oil over the curry.▢ Taste test and adjust salt. If required add sugar. Add the fried eggs and kasuri methi. Mix and simmer for a while. Sprinkle chopped coriander leaves. Serve punjabi egg curry with roti or naan or plain rice.▢ Optional – Pour 3 to 4 tbsps cream or Blend together 10 cashews with half cup water to smooth milk. Pour it to the curry. Cook covered for 2 to 3 mins until the curry turns thick., ▢ Press saute button and add oil to the inner pot of the Instant pot. Add spices & bay leaf.▢ Add ginger garlic and fry for 30 seconds. Then add the tomatoes and salt. ▢ Fry until the tomatoes breakdown. Add chilli powder and turmeric. Saute for a min.▢ When the cumin begins to sizzle add onions and green chilli. Saute until the onions turn light golden.▢ Then pour 1 cup water and mix well to release any bits of food stuck at the bottom of the pot.▢ Place a long leg trivet. Place your basmati rice bowl. Cover it.  Then place the eggs in another bowl. Cover it.▢ Secure the IP with the lid. Position the steam release handle to sealing.▢ Press the pressure cook button (high pressure). Set the timer to 7 mins.▢ When the IP is done, press the cancel button. ▢ When the pin drops, open the lid. Do a quick manual release by moving the steam release handle from sealing to venting. You can also wait for 5 mins for a natural release.▢ Pour cold water to the eggs and let them cool down. Peel the eggs and prick them with a fork.▢ Press the saute button and simmer the eggs in the curry for a minute. Then pour the cream or cashew milk or coconut milk.▢ Stir well and cook until the curry thickens. Taste and add more salt if needed. Turn off and garnish with coriander leaves."
    },
    {
        "Title": "Malai Kofta Recipe (Paneer Kofta Curry)",
        "Ingredients": "▢ 1 heaped cup  paneer  crumbled (about 150 grams)▢ 1 heaped cup  potato boiled & crumbled (about 2 large)▢ 2½ tablespoons corn flour (corn starch)▢ 1 teaspoon ginger paste▢ 2 tablespoons coriander leaves  chopped finely▢ salt as needed▢ ½ to ¾ teaspoon garam masala▢ 1 tablespoons cashews chopped  (optional)▢ 1 tablespoons raisins  (optional)▢ Oil for deep frying, ▢ 1 tablespoon oil▢ 1 cup onions cubed ▢ 1½ cup tomatoes cubed▢ 15 cashew nuts▢ 2 to 3 green cardamoms ▢ ½ inch cinnamon stick (optional)▢ 3 cloves (optional), ▢ 2 tablespoons oil (or 2 tbsp butter)▢ 1 bay leaf (optional)▢ ½ inch cinnamon stick (optional)▢ 2 cardamoms (optional)▢ 1½ teaspoons ginger garlic paste▢ 1 teaspoon red chili powder  (adjust to taste)▢ ¾ to 1¼  teaspoon garam masala (adjust to taste)▢ 1 teaspoon coriander powder (ground coriander seeds)▢ 1 teaspoon salt (adjust to taste)▢ ½ to ¾ teaspoon sugar▢ ½ cup water (¼ cup more if needed)▢ 1 teaspoon kasuri methi (fenugreek leaves)▢ 3 to 4 tablespoons cream",
        "Instructions": "▢ Heat 1 tbsp oil in a pan. When the oil turns hot, add cardamoms, cloves & cinnamon.▢ Then add onions and saute until they turn transparent or golden. ▢ Next add tomatoes & cashews. Saute for 2 to 3 mins. Pour half cup water & boil all the ingredients until soft & mushy.▢ Turn off the stove and cool completely. Add to a blender jar, retain all the whole spices we used. Don't discard them. Blend this to a smooth puree. Strain the puree (filter) through a strainer to another bowl., ▢ Heat a pan with oil or butter. Add bay leaf, cinnamon and cardamoms (all spices are optional here). Saute for a minute.▢ Add ginger garlic paste and saute on a low heat till the raw smell goes away. This takes about 2 to 3 mins.▢ Quickly stir in chili powder, garam masala, coriander powder,salt and sugar. Pour the onion tomato puree. Mix it well.▢ Saute for 3 to 4 mins for the raw smell of chili powder to go away.▢ Pour ½ to ¾ cup water to make a gravy. Cook covered until the gravy thickens and traces of oil are seen on top. The raw smell of the ingredients should have gone.▢ Add kasuri methi and taste test. If needed add more salt.▢ Regulate the flame to low and add cream. Stir and turn off the heat. Set this aside., ▢ To make malai kofta, boil potatoes just until fork tender and not mushy. ▢ Crumble them and add to a mixing bowl along with crumbled paneer, ginger paste, corn flour, salt, garam masala and chopped coriander leaves.▢ Also add raisins and cashews. Or you can stuff them in the koftas.▢ Mix everything well and divide the dough to 8 equal parts. Roll them to balls.▢ If you prefer, you can also flatten each ball. Place the cashews and raisins in the center and seal.▢ Heat oil in a kadai for deep frying. Check if the oil is hot enough by sliding in a small portion of the malai kofta mixture.▢ It has to rise without browning a lot. This is the right temperature. ▢ Test the dough: Wait for the oil to heat up. Pinch off 1 teaspoon of the kofta mixture and roll to a small ball. Slide it to the hot oil to ensure the mixture is right and does not disintegrate. ▢ If the ball does not disintegrate or disperse in oil, then go ahead with the next step. If the ball disintegrates, add more corn starch to fix it (refer notes).▢ Slide the koftas one by one gently to the hot oil. ▢ Deep fry on a medium flame until crisp and golden. Remove them to a steel colander or plate., ▢ Cool the gravy completelt and transfer it to a serving dish.▢ Cool the malai koftas slightly. Place them in the gravy and pour 1 tbsp of cream. (avoid adding hot koftas to hot gravy)▢ Garnish malai kofta with coriander leaves & serve with butter naan or Jeera Rice."
    },
    {
        "Title": "Veg Cutlet Recipe (Vegetable Cutlet)",
        "Ingredients": "▢ 2 cups potatoes peel & cube to ¾ inch (2 large) (or sweet potatoes)▢ ½ cup green peas (frozen or fresh)▢ 1 cup carrot diced (1 large)▢ ½ cup beans chopped (6 to 8)▢ 3 tablespoon coriander leaves or cilantro finely chopped, ▢ ½ teaspoon salt  (adjust to taste)▢ ¾ teaspoon ginger grated or paste▢ 1 to 2 green chilies finely chopped (skip for kids)▢ ½ to ¾ teaspoon garam masala▢ 6 tablespoon bread crumbs or ½ cup thick poha powdered or roasted besan (read notes)▢ 4 tablespoons oil  or as needed, ▢ 2 tablespoon besan or gram flour or rice flour or corn flour▢ ½ cup bread crumbs  or powdered poha for the crust",
        "Instructions": "▢ Peel and chop potatoes to ¾ inch cubes, carrots to ½ inch and beans to smaller bits. ▢ Steamer/pot – Transfer all the chopped vegetables & peas to a steamer basket and steam them until fork tender and not mushy or water logged.or Pressure cook – I pressure cook all the vegetables together for 2 whistles on a medium heat with half cup water. Drain any excess moisture left and use up in your soups.▢ Meanwhile, If you do not have bread crumbs, add some poha to a mixer jar and make a super fine powder. ▢ Add the boiled vegetables to a mixing bowl, cool down slightly and mash them well with a masher.▢ Add bread crumbs, salt, grated ginger, garam masala, coriander leaves and chilies. Mix well to form a non-sticky dough. If using powdered poha, start with 2 tablespoon only and mix well. If it is still too sticky, add more crumbs or powder only as required. (See photos in the post for texture)▢ Taste test and add more salt or spices to your taste. Divide the cutlet dough to 13 to 14 parts. Roll to balls., ▢ Flatten them gently and make thick patties. Keep them aside in a plate and cover to prevent drying.▢ In another plate add ¼ cup bread crumbs or powdered poha for the crust. To another mixing bowl, add besan or rice flour. Pour water just enough to make a slightly thin/runny batter. For a thicker crust, make a thicker batter▢ Arrange all the 3 – Cutlets plate, batter bowl & bread crumbs plate side by side. ▢ Dip each vegetable cutlet in the batter to coat on both the sides. Then place them on the bread crumbs. Gently coat them with the crumbs all over.▢ Place them back on a plate aside. Repeat the same steps of dipping them in the batter and then the crumbs for all the veg cutlets. Leave this aside for about 5 to 10 minutes. ▢ Just before frying, gently shake them off in the plate to remove the excess crumbs., ▢ Lastly heat 1 tablespoon oil for shallow frying in a wide pan. When the oil turns hot, gently place the veg cutlet in the pan. ▢ Fry them on both the sides until golden and crisp. Set aside and fry them in 2 batches using more oil as needed.▢ To bake the veg cutlet – Preheat the oven to 180 C/ 360 C for 15 mins and place the patties on a greased tray. Bake for about 15 mins on each side or until golden and crisp.▢ Serve veg cutlet with green chutney or any sauce."
    },
    {
        "Title": "Gobi Manchurian Recipe | Cauliflower Manchurian",
        "Ingredients": "▢ 1 small head (500 grams) cauliflower /gobi (250 grams cleaned florets)▢ Oil for deep frying as needed, ▢ ½ cup (65 grams) all-purpose flour ( prefer organic or at least unbleached)▢ ¼ cup (32 grams) cornstarch (white corn flour or yellow corn flour)▢ ½ to 1 teaspoon Kashmiri red chili powder or paste (less spicy variety) (optional)▢ ¼ teaspoon black pepper crushed or ground▢ ¼ teaspoon salt (adjust to taste)▢ ½ cup water (more if needed), ▢ 1½ tablespoons oil (for sauce)▢ 1 tablespoon garlic fine chopped▢ ½ tablespoon ginger fine chopped▢ 1 green chili chopped (optional)▢ ⅓ cup onions or spring onions/ scallions fine chopped – green & white separated ▢ ¼ cup bell pepper  (capsicum chopped fine) (optional)▢ 1 tablespoon soya sauce (organic or naturally brewed)(or tamari)▢ 2 to 3 tablespoon Red Chilli sauce (or 2 tsps hot sauce, adjust to taste)▢ 1 to 2 tablespoon tomato ketchup (optional, use if using hot sauce)▢ ½  teaspoon Kashmiri red chili powder  (or paprika optional) ▢ ½ tablespoon rice vinegar (I used apple cider vinegar)▢ 1 teaspoon sugar (adjust to taste)▢ salt as needed▢ 3 to 4 tablespoons water▢ ½ to ¾ teaspoon black pepper crushed or ground▢ ⅛ teaspoon salt (adjust to taste)▢ 2 tablespoons spring onion greens chopped for garnish",
        "Instructions": "▢ Cut gobi to medium size separate florets and add them to 3 cups of slightly hot water (not boiling hot). Rest for 5 mins, discard the water and rinse with cold water. Drain them to a colander.▢ Spread on a clean cloth or pat dry with paper tissues, to remove excess moisture. You can do this ahead and set aside at room temperature. Any moisture in the gobi will cook it to soft and not crisp.▢ Heat up the oil for deep frying on a medium heat. ▢ Meanwhile make the batter by adding cornstarch, all-purpose flour, red chilli powder, black pepper and salt to a mixing bowl.▢ Mix and add water little by little as needed and make a free flowing lump-free batter. The consistency has to be medium and not too thick or very runny. Adjust salt as needed by tasting the batter. (check video)▢ Add the gobi florets to the batter (in batches), coat them well., ▢ When the oil turns hot enough, check by dropping a small amount of batter to the hot oil. The batter has to sizzle and rise to the surface without browning. This is the correct temperature. ▢ Pick up each cauliflower floret with a spoon or fingers & gently drop them one by one to the hot oil. The flame has to be medium initially and should be increased slightly as more gobi is added. Avoid disturbing/ stirring them for 1 to 2 minutes, as the coating can easily turn messy.▢ Reduce the flame to medium and fry until the florets turn golden and crisp. Keep stirring in between for even frying. Remove them with a spider, shaking gently to get rid of the excess oil. ▢ Transfer to a kitchen tissue/paper towel or a steel colander. Repeat the same steps of adding the rest of the cauliflower florets to the batter, coating them well and then frying them in hot oil until crisp. Oil should be medium hot and not smoking hot, before you fry the next batch.▢ For extra crisp gobi manchurian, you can also refry the once fried gobi again in oil. I usually do not do it as frying them once is good enough to get very good crisp manchurian with this recipe., ▢ Optional: Mix together red chili powder with little water (1 tbsp) to a paste and keep aside. This step is optional and is used mainly for the red color.  ▢ Prepare the sauce: Add soya sauce, red chili sauce, tomato ketchup, red chili paste, sugar and vinegar to a small bowl and keep this aside. (for gravy version refer the notes section below). ▢ Heat oil in a wide pan or wok. Add garlic, ginger and green chilies. Saute for a minute or two. ▢ Then add spring onions whites & bell pepper. Saute them on a high flame for 2 mins. ▢ Pour the sauce and water. Mix well and cook stirring until the sauce turns thick. Add black pepper and turn off the heat.▢ Taste test and adjust the heat and salt levels to your taste. The sauce has to be slightly tangy, sweet & hot. If you want you may add more sauce to preference. ▢ Allow the sauce to cool for 1 to 2 mins. Add the fried cauliflower and stir gently to coat well with the manchurian sauce.▢ Garnish gobi manchurian with spring onion greens. Serve immediately as a appetizer or as a side with noodles or fried rice."
    },
    {
        "Title": "Basmati Rice Recipe, How to Cook Basmati Rice",
        "Ingredients": "▢ 1 cup  aged basmati rice▢ 2 cups water reduce by ½ cup if using new rice▢ ½ teaspoon oil or ghee (optional)▢ ¼ to ½ teaspoon salt (optional)",
        "Instructions": "▢ Add basmati rice to a bowl and rinse thrice. Drain the water.▢ Soak the rice for a  minimum of 15 minutes and drain to a colander/ strainer. Shake off gently to get rid of excess water. Avoid soaking if using new harvested rice.▢ Pour water to a heavy bottom pot and add salt, ghee or oil (optional). If you want you may add whole spices like star anise, cinnamon, cloves, cardamoms and cumin seeds.▢ Bring the water to a rolling boil on a high heat and then add the drained rice. You will see the temperature falls after adding rice, so let the water come back to a rolling boil on a high heat., ▢ Reduce the heat to lowest and cover the pot. Cook till all of the water is absorbed, for 10 to 11 minutes. ▢ Do not stir while the rice is cooking. If you see the rice bubbling and frothing up, simply open the lid 1 to 2 times before it overflows and cover back.▢ Insert a rice paddle to the bottom of the pot to check if all of the water is absorbed. Turn off when the water is completely absorbed and the rice is cooked through.▢ Cover and let rest for 10 to 15 minutes on the hot burner (stove turned off)., ▢ Reduce the heat to medium or medium-high so the water does not over-flow. But it is important to keep the water boiling constantly until the rice is cooked through.▢ Place a large pot under the colander or simply place your colander in the clean kitchen sink. When the rice is cooked al dente drain to the colander. ▢ Transfer the rice back to the pot and cover it immediately. Let rest on the hot burner (stove turned off) for 5 to 7 mins.▢ Your fluffy and perfectly cooked basmati rice is ready., ▢ Heat ghee in a wide pot and add the drained rice (completely no water). Increase the heat to high and stir fry the rice occasionally for 2 to 3 mins.▢ Pour water and bring it to a rolling boil. Reduce the heat and cover the pot. Let cook until all of the water is absorbed.▢ You have the fulffy basmati rice under 10 minutes."
    },
    {
        "Title": "Veg Fried Rice Recipe (Vegetable Fried Rice)",
        "Ingredients": "▢ 1 cup Rice (uncooked or 3 cups cooked like basmati, jasmine)▢ 1 tablespoon Garlic chopped▢ 2 tablespoons oil (peanut, sunflower or avocado)▢ 1 tablespoon Soya sauce (or tamari, adjust to taste)▢ 1 teaspoon Vinegar (rice vinegar or apple cider)▢ Salt as needed (I use ¼ teaspoon)▢ ½ teaspoon Black pepper coarsely crushed, ▢ ¼ to ½ cup Carrots chopped finely▢ ¼ cup Bell peppers (capsicum) chopped finely▢ ¼ cup French beans (4 to 5 green beans, chopped finely)▢ ¼ cup Green onions  (scallions/spring onions, 4 stalks, fine chopped)▢ ¼ cup Cabbage (optional, or ¾ cup mushrooms sliced )▢ 1 green chili slit (optional, for heat)",
        "Instructions": "▢ Skip this section if you have precooked rice. Wash rice a few times till the water runs clear. ▢ Soak it for at least 10 mins. Meanwhile bring 4 to 5 cups water to a boil in a large pot.▢ When the water begins to boil rapidly, drain the rice and add it to the water. Pour 1 tsp oil to prevent the rice from turning sticky.▢ Cook rice till al dente. Rice must not be mushy but has to be grainy. ▢ Drain off the rice to a colander. Cool it completely & fluff it up with a fork. ▢ While the rice cools, chop the veggies and garlic. Keep aside 2 tablespoons of green onions for garnish., ▢ Heat a wok with oil on the highest flame and fry chopped garlic slightly just for 30 to 40 seconds. ▢ Next add all the chopped vegetables and fry for 2 to 3 minutes just until half cooked. They should be crunchy and not soft.▢ Add soya sauce. Then add the optional ingredients vinegar and half tsp sugar. Sugar helps to preserve the bright colors of veggies and helps to balance the flavors.▢ Immediately add cooled rice, ¼ teaspoon salt and black pepper. Fry the vegetable fried rice for 2 mins. ▢ Garnish veg fried rice with fresh green onions. Tastes good on its own but you can also pair it with veg manchurian or chilli paneer."
    },
    {
        "Title": "Ghee Rice Recipe",
        "Ingredients": "▢ 1 cups basmati rice▢ 2 tablespoons ghee or clarified butter▢ 1 medium onion  thinly sliced (optional)▢ 1¾ cups water for Indian cooker (1¼ cup Instant pot, 2 cups for normal pot)▢ 1 green chilies (slit or chopped)▢ ½ teaspoon Salt  (adjust to taste)▢ 14 cashewnuts (kaju, 28 split)▢ 14 raisins, ▢ 2 inch cinnamon (dalchini)▢ 4 cloves (laung)▢ 3 to 4 green cardamoms (elaichi)▢ 1 strand  mace (javitri)▢ 1 star anise (chakri phool)▢ 1 bay leaf (tej patta)",
        "Instructions": "▢ Add rice to a bowl and rinse well at least thrice. Soak it for at least 20 to 30 minutes. Drain and set aside. While the rice soaks, slice onion thinly & slit green chilies.▢ Heat a pressure cooker or a pot with ghee. Fry cashews till lightly golden, add raisins and stir up. When they turn plump set them aside in a plate.▢ To the same pan, add onions. You can also skip onions from the recipe. Fry them till golden, about to caramelize but not burnt. These are the fried onions / barista.  These onions are used for garnishing and they add flavor to the rice., ▢ Add all the whole spices to the pan & fry for a min until aromatic. ▢ Add green chilies, drained rice & fry on a medium flame for about 3 to 4 minutes. Stir to prevent burning . ▢ Pour water and salt as needed. You may need to add more or less water depending on the rice (read my notes below). ▢ Taste the water and check the salt. If needed add more. Ideally the water has to be slightly salty.▢ If making in a pressure cooker, cook on a medium heat until you hear 1 whistle. If making in pot, cover and cook on a very low flame until the rice is cooked fully but not mushy.▢ When the pressure releases, Open the lid and gently fluff up the rice with a fork. ▢ Transfer ghee rice to a serving bowl or plate. Garnish with raisins, cashews, fried onions and coriander leaves.▢ Serve ghee rice with any gravy like kurma, curry or even with egg roast. You can also eat it plain., ▢ Press the SAUTE button & add ghee to the inner steel pot of the Instant pot.▢ When the ghee melts, add the cashews & saute until they turn light golden.▢ Then add in the raisins and stir until they plum up. Remove the cashews and raisins to a small plate.▢ Stir in the onion slices to the ghee and spread them in a single layer.▢ Next stir them every now and then until they turn golden to light brown & aromatic. If the pot is too hot, you can switch the saute to low by pressing (saute button again). Drain the ghee well and remove to the same plate.▢ Now add in all the whole spices, followed by the green chilli and drained rice.▢ Saute for 30 to 60 seconds & press CANCEL button.▢ Pour water and add salt. Deglaze by scrubbing the bottom of the steel pot with a spatula. Taste the water and add more salt if needed.▢ Secure the instant pot with the lid. Position the steam release handle/ vent to sealing.▢ Press the PRESSURE COOK button (or manual on older IPs) and set the timer to 5 mins.▢ When the IP beeps, wait for natural pressure release for 2 to 3 mins. For softer rice, you can wait upto 5 mins. Then release the rest manually by moving the steam release handle from sealing to venting.▢ Cool down a bit and then garnish ghee rice with fried onions, raisins and cashews."
    },
    {
        "Title": "Tomato Rice Recipe (Indian Style)",
        "Ingredients": "▢ 1 ½ cups aged basmati rice (or any non-sticky rice, refer notes)▢ 2 tablespoons oil or ghee▢ 1 medium onion (chopped or sliced)▢ 1 green chili  (slit, optional)▢ 1 tablespoon ginger garlic paste or crushed▢ 1 cup tomatoes (2 to 3 medium sized) (chopped or pureed)▢ ¾ teaspoon salt  (adjust to taste)▢ ¾ to 1 teaspoon garam masala powder or curry powder▢ ½ to 1 teaspoon red chili powder or paprika (reduce for less spicy)▢ ¼ teaspoon Turmeric (haldi)▢ 2 ½ cups water for cooker (3 cups for pot & 1¾ cups + 2 tbsp for Instapot)▢ 3 tablespoon coriander leaves (cilantro) finely chopped▢ 1 tablespoon lemon juice (optional)▢ 12 whole cashewnuts (split & use) (optional), ▢ 1 small bay leaf or curry leaves▢ ¾ teaspoon cumin seeds (jeera)▢ 1 inch cinnamon piece (dalchini)▢ 3 green cardamoms  (elaichi)▢ 3 cloves (laung)",
        "Instructions": "▢ Add 1½ cup rice to a bowl and rinse it well a few times until the water runs clear. Pour fresh water and soak the rice for 30 mins. Then drain to a colander & set aside.▢ Heat a pressure cooker or a pot with 2 tbsps ghee or oil. ▢ Add cashews and fry until golden. Remove to a plate & set aside.▢ Saute 3 cloves, 1 inch cinnamon piece, ¾ tsp cumin, 3 green cardamoms and 1 small bay leaf. ▢ When they begin to crackle, add 1 finely chopped onion and 1 slit green chili. ▢ Saute until the onions turn golden. Next saute 1 tbsp ginger garlic paste until a nice aroma comes out for 30 seconds. ▢ Next add in 1 cup tomatoes, salt as needed and ¼ tsp turmeric. ▢ Saute for 2 to 3 minutes. Cover & cook until the tomatoes break down & turn mushy.▢ Add ½ to 1 tsp red chili powder and ¾ to 1 tsp garam masala powder. ▢ Mix and cook until the tomato masala turns completely soft and mushy. ▢ At this stage the masala leaves the sides of the pan. Pour water & stir well. Taste the water and add more salt if needed. ▢ Bring the water to a rolling boil. Add the drained rice., ▢ Cook until the water has almost absorbed. When the rice is still soggy, lower the flame completely and cover with a lid until the tomato rice is cooked completely. ▢ Sprinkle chopped coriander leaves and squeeze in some lemon juice. Tomato rice is ready to serve hot or warm with a raita. Garnish with  cashews., ▢ Stir and cover with the lid. Cook on a medium high heat. Allow to whistle once. When the pressure goes down, open the lid. Fluff up the tomato rice., ▢ Soak rice for 30 mins. Press SAUTE button & pour oil to the inner pot of the instant pot. Then fry cashews until golden and remove them. Stir in the whole spices and then add onions. ▢ Saute them until transparent. Add the ginger garlic paste & saute for 30 seconds. Add tomatoes and salt. Saute them until the tomatoes break down and turn mushy. ▢ Add chilli powder, garam masala & turmeric. Saute for just 1 to 2 mins untilthe moisture from tomatoes almost dries up. ▢ Next pour 1¾ cups + 2 tbsp water. Press CANCEL button. Scrape off any bits of spices stuck at the bottom. This prevents from getting a burn notice. ▢ Stir & check the salt. Add more if needed. Then add the rice. Then secure the lid. Set the steam release handle/ value to sealing. Press PRESSURE COOK button (highpressure) for 5 mins.▢ When the tomato rice is done, Instant pot beeps. Wait for 2 mins & release the pressure manually with the help of a spoon by moving the steam release handle to venting from sealing. If you like softer rice then let the pressure release naturally for 7 to 8 mins. Then release the rest manually. ▢ Sprinkle coriander leaves & fluff up the tomato rice with a fork. Garnish with cashews."
    },
    {
        "Title": "Khichdi Recipe",
        "Ingredients": "▢ 1 to 2 tablespoons ghee (clarified butter) or oil▢ ¾ to 1 teaspoon cumin seeds▢ 1 bay leaf  or 1 sprig of curry leaves (optional)▢ ¾ to 1 teaspoon ginger grated or ginger paste (1 inch piece)▢ ¼ cup onion finely chopped (1 very small, optional)▢ 1 green chili slit or ½ tsp red chili powder▢ ½ cup tomatoes deseeded & fine chopped or pureed (1 medium)▢ ¼ teaspoon turmeric▢ ⅓ teaspoon salt (adjust to taste)▢ ½ cup rice (any kind or quinoa, steel cut oats, millets)▢ ½ cup moong dal (skinless petite yellow lentils) (or any other dal)▢ 4 cups water (more to adjust, for porridge consistency)▢ 1 pinch asafoetida (hing) (optional)▢ ½ tablespoon ghee for topping, ▢ 1 medium carrot cubed▢ 8 french beans cut to 1 inch length▢ 1 small potato cubed",
        "Instructions": "▢ Add rice and moong dal to a pot. Rinse them at least thrice & drain water completely. If you do not have a cooker, then soak them for 30 to 40 mins. This will help them cook faster.▢ Heat ghee in a pressure cooker or pot on a medium heat. Once the ghee is hot, add bay leaf (optional) and cumin seeds.▢ Soon the seeds begin to splutter, then add ginger & saute until fragrant, for about 30 to 60 seconds & sprinkle hing.▢ Add onions and green chilies. Saute them until the raw smell of onions goes away & they begin to turn golden.▢ Next add tomatoes, carrots, beans, salt and turmeric. Saute for 3 to 4 mins. ▢ Then add drained daal and rice. Saute for 3 to 4 mins.▢ Pour 4 cups water for porridge like consistency or 3 cups for mushy consistency.▢ Stir well & taste the water. Add more salt if needed., ▢ Cover the pressure cook and let it cook for 2 whistles on a medium flame for a mushy khichdi. Cook for 4 to 5 whistles on a medium flame for porridge consistency. ▢ Let the pressure release on its own, then open the lid and mix well. If the consistency is too thick for your liking, pour about ½ to ¾ cup hot boiling water and simmer for 1 to 2 mins until dal khichdi begins to bubble. Taste test and adjust salt., ▢ If cooking in a pot, bring water to a boil on a high flame. Then reduce the flame to medium to low and continue to cook. ▢ Leave the pot uncovered or partially covered so the froth won't overflow. Keep checking and add more hot boiling water (about ½ to ¾ cups) as needed until the lentils are fully soft cooked. ▢ When both are done, mash the khichdi slightly so you get a thicker consistency. Adjust salt as needed.▢ Transfer to serving plates and pour 1 tsp ghee on the hot khichdi. Serve with papad and pickle., ▢ Press saute button (medium) on your Instant pot.  Pour ghee to the steel insert.▢ As soon as the ghee melts, add bay leaf and cumin seeds.▢ When cumin begins to sizzle add onions & chopped chili. ▢ Saute until onions turn transparent. Next add in ginger, hing, tomatoes, all veggies & turmeric. ▢ Saute for 2 to 3 mins until tomatoes turn mushy. ▢ Add drained rice & lentils. Saute them for another 2 to 3 mins. ▢ Next add salt & pour water. Deglaze the pot by scraping the bottom with a spatula to remove bits of food stuck in there if any. Mix well & taste the water. ▢ Add more salt if needed. Secure the lid & move the steam release handle to sealing.▢ Press the pressure cook or manual button (high pressure). Set the timer to 8 mins. Or you can also press porridge button & set timer to 9 mins. ▢ Once it is done, the instant pot beeps, then press cancel and switch off. ▢ Wait for a natural pressure release for 10 minutes & release the rest manually.▢ When the float valve drops, open the lid & stir gently.▢ If you like soupy khichdi, add some hot boiling water to bring to consistency you like. Saute for 1 minute if you prefer.▢ Top dal khichdi with little ghee & serve with pickle or papad or chutney."
    },
    {
        "Title": "Jeera Rice Recipe (Cumin Rice)",
        "Ingredients": "▢ 1½ cups basmati rice  (aged rice, refer notes)▢ 2 tablespoon ghee  or oil or butter▢ 1 green chili  slit and deseeded (optional)▢ 2½ cups water for pressure cooker or (1¾ cups + 2 tbsps for instant pot) or (3 cups for regular pot)▢ ½ to ¾ teaspoon salt  as needed, ▢ 2 teaspoons cumin seeds (jeera)▢ 1 bay leaf (tej patta)▢ 4 green cardamoms (elaichi)▢ 2 inch cinnamon piece (dalchini)▢ 4 cloves (laung)▢ 1 strand mace (javitri) (optional)",
        "Instructions": "▢ Wash rice a few times until water runs clear. ▢ Then soak it in lot of water for at least 30 mins. Drain it completely., ▢ Heat ghee or oil in a pressure cooker or a pot.▢ Saute bay leaf, cloves, cinnamon, cardamoms and mace until they begin to sizzle. ▢ Fry jeera on a low flame until a nice aroma comes out. Add green chilli.▢ Transfer drained rice to the pot or cooker and fry for 2 to 3 mins. Do not stir vigorously as the rice grains will break. ▢ This frying step helps to bring out the aroma of the rice.▢ Pour water and add salt. Stir well and taste the water. It must be slightly salty. Bring water to a boil on a high flame. ▢ Making Jeera rice in pot – Cover and cook on a low to medium heat until water is absorbed & rice is done. Once done, turn off the heat and let the rice rest in the pot for 15 mins. This helps the grains to expand and become fluffy.▢ Making Jeera rice in pressure cooker – Cover the pressure cooker with a lid. Cook on a high heat for 1 whistle. For al dente rice, I release the pressure carefully after 2 mins with the help of a wooden spatula.▢ When the pressure releases completely, open the lid and fluff up jeera rice with a fork. Serve with any curry., ▢ Press saute button and pour ghee to the inner pot of instant pot. ▢ Add all the spices & saute for 1 min until they turn fragrant. Add the drained rice and chilli. Saute for 2 mins stirring occasionally. Do not stir a lot, rice grains will break.▢ Pour 1¾ cups plus 2 tbsps water and add salt. Stir and taste the water. If needed add more salt.▢ Secure the lid & position the steam release handle to sealing. ▢ Press the pressure cook button, set to high pressure. Set the timer for 5 mins. ▢ When done the instant pot beeps. Let the pressure release naturally for a min and release the rest of the pressure manually with the help of a long spoon (moving the vent from sealing to venting). This will give you al dente cooked jeera rice. (Do this always for a larger batch, even for softer rice, refer notes).▢ For softer rice, let the pressure release naturally for 3 to 4 mins. ▢ Fluff up the Jeera rice with a fork & add some coriander leaves. Serve with dal or your favorite curry."
    },
    {
        "Title": "Gulab Jamun Recipe",
        "Ingredients": "▢ 1 cup milk powder▢ 5 tbsp  all-purpose flour  (maida)▢ 1 tsp ghee or oil▢ 1 tbsp ghee  or oil for greasing▢ 2 to 4 tbsp milk (use more as needed)▢ 1 tbsp curd (yogurt or ¾ tbsp lemon juice)▢ 1 large pinch Baking soda or 1/8 th tsp▢ Ghee or oil for deep frying▢ 1 tsp pistachios chopped, ▢ 1 ¼ to 1 ½ cups Sugar▢ 1 ½ cup water▢ 4 pods green cardamom  or ¼ tsp cardamom powder▢ 1 tsp rose water",
        "Instructions": "▢ Mix together water, sugar and crushed cardamoms in a pot. ▢ Boil the syrup until it turns slightly sticky. ▢ Turn off the stove before it goes to a 1 string consistency. ▢ If it reaches a 1 string consistency, then add 2 tbsp of water and mix. ▢ Add rose water and mix. Set aside to keep it hot., ▢ Fluff up the flour in the jar with a fork and then measure correctly.▢ Mix together flour, milk powder and soda in a bowl. Either sieve it or mix uniformly.▢ Add ghee to it.  Mix well. ▢ In a small bowl, mix together lemon juice or yogurt and 2 tbsp milk.  ▢ Pour 1.5 tbsp of this to the flour mixture. ▢ Begin to bring the flour together to make a dough. ▢ If the dough is too dry, add little more milk & curd until you get a smooth dough. Do not add a lot. Use only as needed. ▢ The dough turns sticky. Grease your fingers and make a ball. ▢ The dough must not be soggy. It must hold the shape well and should be smooth without any cracks.▢ Divide to 14 to 18 equal sized portions. Grease your hands and roll to smooth balls. ▢ They must be smooth without any cracks or lines otherwise you will find many cracks on the gulab jamuns. Keep them covered., ▢ Heat up the pan with ghee or oil on a medium heat. ▢ Also check if the syrup is hot. If it is not hot, heat it up a bit. It must be hot and not very hot.▢ To check the right temp, you can drop a small piece of dough in the oil. ▢ It must rise slowly without changing its color. ▢ If it rises rapidly then you will need to cool the oil a bit before frying.▢ When the ghee is just medium hot, add the balls. ▢ Make sure the oil is not very hot else the gulab jamuns will brown without cooking well. ▢ Fry the balls on a medium flame for 1 to 2 mins. Then regulate the flame to low flame & fry until golden. Keep stirring gently to fry them uniformly.▢ Add them to the hot syrup. Allow them to rest for 3 hours and serve. ▢ Garnish gulab jamun with chopped pistachios."
    },
    {
        "Title": "Jalebi recipe",
        "Ingredients": "▢ 1 cup all-purpose flour (organic maida) 125 grams▢ 2 tablespoons corn flour (or besan if fermenting batter) (16 grams)▢ 1/8 teaspoon turmeric or use natural food color▢ ½  cup curd (plain yogurt) (or water if fermenting batter) (120 ml)▢ ½  cup water (more if needed) (120 ml)▢ ½ teaspoon baking soda  (or 1 large pinch for fermented batter)▢ 1 teaspoon lemon juice▢ oil or ghee as needed, ▢ 1 cup sugar (use organic) (200 grams)▢ ½ to ¾ cup water (I used ½ + 2 tbsps) (120 ml to 180 ml)▢ 1 pinch saffron or kesar optional▢ ¼ teaspoon cardamom powder or elaichi powder▢ 1 teaspoon lemon juice, ▢ 1 sauce bottle or Zip lock bag or cloth bag",
        "Instructions": "▢ Add sugar and water to a pot. ▢ Boil on a medium heat until it reaches a 1 string consistency. ▢ Take a small portion of the syrup in a spoon. Cool it slightly. ▢ Take it in between your thumb and fore finger. ▢ Gently move the fingers away from each other, you must see a single string. ▢ Pour lemon juice, cardamom powder and saffron. Remove from heat. Stir and set aside.▢ If your syrup goes beyond this stage, then sprinkle some water and mix. Recheck for the 1 string consistency., ▢ A. Method 1: For Instant jalebi : Add maida, cornflour and turmeric to a mixing bowl. Mix everything well until uniform. Next add curd. Pour water & make a thick lump free batter. The batter has to be thick but of flowing consistency. If needed add more water. Beat the batter well with a whisk in one direction in a circular motion for 4 mins. The batter will turn smooth., ▢ B. Method 2: For fermentation : Mix together maida, besan & turmeric in a bowl. Pour water & make a thick batter of pouring consistency. Cover and ferment for 12 to 24 hours until the batter gets a very mild sour flavor. The batter will not rise, but will have tiny bubbles on top., ▢ Heat ghee or oil on a medium heat to fry jalebis. ▢ If using oil, then add 1 to 2 tbsp ghee to the oil. This enhances the flavor.▢ Pour 1 tsp lemon juice to the batter & mix. Skip the lemon juice if you have fermented the batter.▢ Add soda and mix gently just until combined.▢ Check batter consistency: The prepared batter must be smooth free flowing and thick. Spoon just 2 to 3 tbsp of batter to the sauce bottle to check if the consistency is right.▢ Next check if the oil is hot enough by dropping a small portion of the batter. It has to come up immediately without browning.▢ Now squeeze the bottle gently and move in circular motion to get spiral. If you are getting very  thick jalebi, then the batter is thick. Next if you are getting very thin flat jalebis the batter is thin. ▢ To fix thick batter, add a tbsp or more water. Next to fix thin batter, add a tbsp of maida (all purpose flour). Take a look at the pic in the FAQ section to fix the batter.▢ Mix the batter well. Spoon it to the bottle., ▢ Ensure oil is hot and the flame set to medium high heat. ▢ Squeeze in the batter gently in circular motions starting from the center moving outside. ▢ You can also do it the other way.  You will get properly shaped ones after making a few.▢ While the jalebi is getting fried, check the syrup. It must be slightly hot to warm when the jalebi is dipped into it. If not heat up a bit.▢ The last 1 minute, turn the flame to low and fry the jalebi. This helps to make them extra crisp.▢ When the jalebi is done it turns crisp. Remove it with a skewer and add to the warm sugar syrup directly.▢ Allow to rest for 2 mins. Remove to a plate. Continue to make more jalebis.▢ Serve jalebi hot."
    },
    {
        "Title": "Chicken Tikka Masala Recipe",
        "Ingredients": "▢ 1½ lbs. (700 grams) chicken boneless (Preferably thighs, or breasts)▢ ½ cup (120 ml) Greek yogurt (hung curd)▢ ½ to 1 teaspoon Kashmiri red chili powder (use less for low heat)▢ 1 teaspoon garam masala▢ ¼ teaspoon turmeric▢ 1 teaspoon coriander powder▢ ½ teaspoon cumin powder▢ ½ teaspoon salt▢ 1 tablespoon lemon juice▢ 1 tablespoon kasuri methi▢ 1 tablespoon ginger garlic paste▢ 1 tablespoon oil (mustard oil if you have), ▢ 3 tablespoons oil (or ghee)▢ 1½ cups (150 grams) onions  (fine chopped, 1x – 1 large or 2 medium)▢ 1 green chilli (optional)▢ 1 teaspoon salt▢ 1 tablespoon ginger garlic paste▢ ½ to 1 teaspoon Kashmiri red chili powder (use less for low heat)▢ 2 teaspoons garam masala (adjust to taste)▢ 1 tablespoon coriander powder▢ 1 to 1½ teaspoon cumin powder▢ 1 to 2 teaspoons sugar (adjust to taste)▢ 1.1 lbs. (500 grams)  fresh tomatoes (pureed/chopped or 10 oz., 1¼ cup tomato puree/ passata, read notes)▢ 1 cup hot water (double if using cashews)▢ 1 tablespoon kasuri methi (dried fenugreek leaves)▢ ½ cup heavy cream/whipping cream (or 1x – ⅓ cup whole raw cashews, 30, refer notes), ▢ 3 tablespoons heavy cream (or any cream)▢ 3 tablespoons coriander leaves (fine chopped)",
        "Instructions": "▢ Cube chicken to 1 to 1½ inch pieces. Add them to a mixing bowl. Make sure there is no excess moisture in your chicken. If you want you may pat dry with a few kitchen tissues.  ▢ Add red chilli powder, garam masala, cumin powder, coriander powder, turmeric, salt, lemon juice, oil, ginger garlic paste, yogurt and kasuri methi. Skip the lemon juice if your yogurt is sour.▢ Mix well. Cover with a cling wrap and refrigerate for minimum of 8 hours and up to 48 hours. If you are in a rush, you may cut down to 3 hours., ▢ Heat oil or ghee in a pot or pan. Add onions and sprinkle 1 teaspoon salt. Saute until deep golden.▢ Add ginger garlic paste and green chilli. Saute until aromatic, for 40 to 60 seconds.▢ Reduce the heat to low. Add red chilli powder, coriander powder, garam masala and cumin powder. Stir well quickly.▢ Add the tomatoes and cook on a medium high heat until the onion tomato masala becomes really thick and begins to leave the sides of the pan. It also turns fragrant. (Check video for consistency)▢ Pour hot water and cover. Simmer until thick, yet of pouring consistency. (Check video for consistency)▢ Optional – Cool down and blend to a smooth puree. Return it to the pot and heat up. This step cuts down the acidity from canned tomatoes., ▢ Grill in Oven : While the gravy simmers, thread the chicken to the metal skewers or soaked bamboo skewers and place them in a prepared tray. Bake them in a preheated oven at 460 F or 240 C for 9 to 10 mins. Turn them to the other side with a tong and grill then for another 9 to 10 mins. To char the chicken, broil for 2 to 3 mins or until slightly charred. ▢ Or In a Skillet: Pour 1 tbsp oil to a skillet and heat it well. Place the chicken tikka one by one, spacing them apart. Cook on a medium high heat for 3 mins, turn them to the other side with a tong and cook for another 3 mins, until charred and   not essentially fully cooked. Remove to a plate and Cook in batches.▢ Or In the Air fryer: Thread on skewers and place them in the basket or in the tray. Air fry for 6 mins, at 400 F or 200 C. Turn them with tongs and air fry for another 6 mins. If they dry out, you may baste with marinade and continue for another 2 mins, until slightly charred.▢ When the tikka masala turns thick, add sugar and the cream (or cashew cream, check notes to make your own). Stir well and cook for a few minutes until thick, creamy and aromatic. (Check video for consistency)▢ Add the grilled chicken tikka and crushed kasuri methi. (Make sure your gravy has reached a thick gravy consistency/serving consistency, before adding chicken). Stir and cook for 2 to 3 mins until chicken tikka is soft and tender. Taste test and add more salt, garam masala and sugar if needed.▢ Turn off and garnish with cream and coriander leaves. Serve chicken tikka masala with Butter Naan, roti, paratha, Basmati rice or Jeera rice."
    },
    {
        "Title": "Chicken Biryani Recipe",
        "Ingredients": "▢ ½ kg (1.1 lbs) chicken (skinless bone-in or boneless, large pieces such as thighs, drumsticks, legs or mix of all)▢ 3 tablespoons plain yogurt (curd or dahi)▢ 1¼ tablespoons ginger garlic paste (1 inch ginger & 4 garlic cloves crushed)▢ ½ to ¾ teaspoon salt (adjust to tase)▢ ¼ teaspoon turmeric ▢ ½ to 1 teaspoon red chilli powder  (or paprika) (use less spicy variety)▢ ½ to 1 tablespoon garam masala (or biryani masala) (Refer notes)▢ 1 tablespoon Lemon juice  (optional), ▢ 1 bay leaf  (tej patta)▢ 4 green cardamoms (choti elaichi)▢ 6 cloves (lavang)▢ 1 inch cinnamon (dalchini)▢ 1 star anise (chakri phool )▢ ¾ teaspoon shahi jeera (caraway seeds) (substitute with cumin)▢ 1 strand mace  (javitri, omit if you don't like), ▢ 2 cups basmati rice (aged rice only)▢ 2 tablespoon ghee or Oil▢ 1 large onion  sliced thinly▢ ¼ to ½ cup mint leaves chopped fine (about 15 leaves)▢ 1 green chili (slit or chopped)▢ ¼ cup plain yogurt (Indian curd)▢ ¼ to ½ teaspoon red chili powder  (optional, for heat)▢ 1 teaspoon garam masala (or biryani masala)▢ 3 cups water (3½ cups for pot) (refer notes, more if needed )▢ ¾ teaspoon salt (to stir in water)▢ 2 tablespoon fried onions (optional)▢ 1 pinch saffron (optional)(soaked in 2 tbsps hot milk)",
        "Instructions": "▢ To a bowl, add yogurt, ginger garlic paste, salt, garam masala, turmeric, lemon juice & red chili powder.▢ Mix up well and taste the marinade. Add more salt and spice if needed.▢ Make slits on the chicken pieces. Add it to the marinade & mix well. Cover and set aside for 1 hour to overnight. ▢ Rinse basmati rice thrice and soak for 30 mins. Drain to a colander after 30 mins., ▢ Heat ghee or oil in a pot or pressure cooker.▢ Add whole spices – bay leaf, cardamoms, cloves, cinnamon, star anise, shahi jeera & mace. Skip them if you do not have.▢ When the spices begin to sizzle, add onions & fry them evenly stirring often until uniformly light brown but not burnt.▢ Add chicken & saute until pale for 5 mins on a medium heat. ▢ Cover & cook on a low flame until the chicken is soft cooked or tender. Saute to evaporate any excess moisture in the pot. ▢ Taste test and add more salt if needed. Add yogurt (curd), half of the chopped mint leaves, slit green chili, red chili powder & garam masala.½ to 1 teaspoon red chilli powder, 1 green chili, ¼ cup plain yogurt, 1 teaspoon garam masala, ▢ Mix everything well and layer chicken evenly at the bottom. (check video)▢ Spread drained rice in a layer over the chicken.▢ To a separate pot, pour water. If cooking in a pot use more water.▢ Add salt and mix. Taste the water. It must be slightly salty. Bring this to a rolling boil.▢ Pour 2 cups of this water across the sides of the cooker or pot. Gently pour the rest on top of the rice. (check video)▢ Level the rice if needed. Sprinkle the rest of the mint leaves. Optionally add fried onions & saffron soaked milk if using.▢ Pot method – If cooking in a pot, cover and cook on a medium flame until the rice in the chicken biryani is cooked completely but not mushy or undercooked. If the rice is still under cooked or hard & there is no water at the bottom, pour ¼ to ½ cup more boiling water depending on the kind of rice used and cook further. When done it has to be fully cooked, yet remain grainy but not mushy.▢ Cooker method – Set the flame to medium high. Cover & place the whistle. Cook until you hear 1 whistle. Move the cooker away from the burner to stop cooking further. ▢ Rest until the pressure drops naturally. Fluff up the chicken biryani with a fork. ▢ Serve from top to the bottom layer. Each serving gets biryani rice from top and chicken from the bottom layer. ▢ Enjoy chicken biryani with raita and sliced veggies, papad and shorba (biryani gravy)."
    },
    {
        "Title": "Chicken Curry Recipe",
        "Ingredients": "▢ ½ kg (1.1 lbs.) chicken (preferably bone-in, boneless is okay)▢ 2 to 3 tablespoons oil▢ 1 cup (3 medium) onions (fine chopped)▢ 1 to 2 green chilies (slit, omit for less spicy, Thai or Indian chili peppers or serrano peppers)▢ 1 tablespoon ginger garlic paste or ¾ inch ginger, 3 cloves garlic minced▢ ½ cup (2 medium) tomatoes  (pureed or finely chopped)▢ ¼ cup yogurt (or 1½ tbsp cashew butter or 12 cashews powdered & pureed with ¼ cup water, refer notes)▢ ½ to ¾ teaspoon salt  (adjust as needed)▢ ½ to 1 cup hot water (or light coconut milk)▢ 2 tablespoons coriander leaves or mint leaves finely chopped, ▢ ¼ teaspoon turmeric powder▢ 1 teaspoon Kashmiri red chili powder or smoked paprika (½ tsp for less spicy)▢ 1 teaspoon garam masala (½ tsp more if needed, adjust to taste)▢ 1 teaspoon coriander powder, ▢ 1 bay leaf or 1 sprig curry leaves▢ 4 cloves▢ 2 inch cinnamon piece▢ 3 green cardamom",
        "Instructions": "▢ On a medium flame, heat oil in a deep pan.  Add the whole spices – bay leaf, cinnamon, cloves & green cardamoms. ▢ Stir in the chopped onions and chilies. Saute until deep golden in color, for 7 to 8 mins. ▢ Add ginger garlic paste and saute till you get a nice aroma, for about a minute.▢ Then add tomatoes, turmeric and salt. Mix well and cook until the tomatoes turn soft & mushy.▢ Turn down the heat to low, Stir in the yogurt (or cashew paste), red chili powder, garam masala & coriander powder.▢ Cook on low heat, until the mixture smells good and aromatic.▢ Add chicken and coriander leaves. Fry on a medium heat till the chicken turns white or pale in color. This takes around 3 mins.▢ Cover and cook on a low heat for 3 to 4 minutes. This step is very important as the chicken absorbs all the flavors of the spices.▢ Meanwhile in a separate pot, heat up 1 cup water. Using cold water most times toughens the chicken so it is good to use hot water., ▢ Pour hot water just enough (about ½ cup) to make a thick gravy. As you cook, chicken lets out plenty of moisture, depending on that add more water. Check the pictures in the post for consistency.▢ Cover and cook on a medium flame till the chicken is soft cooked and the curry/gravy turns thick. When the chicken is cooked completely it will fall off the bone easily. ▢ Taste the curry & add more salt if needed. You can also add another ½ tsp garam masala at this stage if you feel it is less in flavors.▢ Lastly garnish with coriander leaves, cover and off the heat. Serve chicken curry with butter naan or jeera rice."
    },
    {
        "Title": "Tandoori Chicken Recipe",
        "Ingredients": "▢ ¾ kg (1.5 lbs.) chicken skinless thighs or legs▢ ½ cup Greek yogurt (hung curd)▢ 1 tablespoon ginger garlic paste (or grated in equal quantities)▢ 1 teaspoon garam masala▢ 1 teaspoon red chilli powder (kashmiri or any low heat chilli)▢ ¼  teaspoon black pepper crushed (powder)▢ 1 teaspoon coriander powder (daniya powder)▢ ¼  teaspoon salt (taste marinade & add more)▢ ¼  teaspoon turmeric (haldi)▢ 1 teaspoon kasuri methi (dried fenugreek leaves)▢ 1 tablespoon lemon juice▢ 1½ tablespoon oil (preferably mustard oil)▢ 1 tablespoon chopped coriander leaves to garnish, ▢ 1 teaspoon Kashmiri red chili powder▢ 1 to 2 tablespoon oil (preferably mustard oil)",
        "Instructions": "▢ In a large mixing bowl, stir together yogurt, ginger garlic paste, garam masala, red chili powder, salt, turmeric, kasuri methi, pepper, coriander powder, oil and lemon juice. Taste, adjust salt and heat levels to your taste.▢ Pat dry chicken with paper towels and make deep slits (3 to 4 on larger thighs or 2 to 3 on smaller). Add them to the marinade & coat them well. ▢ Cover and rest in the refrigerator for least 6 hours to overnight., ▢ Preheat the oven to 470 F – 240 C. (If using a smaller oven like a OTG, preheat at  430 F – 220 C). Place a wire rack over a baking tray, lined with foil for easy cleanup. Spray oil over the wire rack.▢ Arrange the marinated chicken on the rack. Roast/bake the chicken for a total of 25 to 30 mins (depending on the size of chicken), basting with chili oil/ melted butter after the first 12 to 15 mins. (Check at 12 mins mark)▢ Turn the chicken to the other side after basting and roast for another 12 to 15 minutes, followed by 2 to 3 minutes of broiling to get some charred spots. The timings can vary depending on your oven and the size of chicken. So adjust accordingly.▢ When the chicken is cooked through, an instant-read thermometer inserted into the thickest part should read 165 to 170 F (75 C). Optionally you may smoke the chicken following the steps in my post.▢ Brush the drippings or melted butter all over the chicken to keep it moist. Garnish with chopped coriander leaves. ▢ Serve with this Cilantro Chutney or Pudina Mint Chutney alongside onion and lemon wedges. For a complete meal, serve it with Turmeric rice, kachumber and Cucumber raita."
    },
    {
        "Title": "Chicken Korma Recipe",
        "Ingredients": "▢ ½ kg (1.2 lbs) chicken  (bone-in) ▢ ¼ teaspoon ground turmeric▢ 3 tablespoons curd ( plain yogurt or coconut milk)▢ 1 tablespoon ginger garlic paste (ground or crushed in equal quantities)▢ ¾ to 1 teaspoon garam masala  or korma masala▢ 1 to 1¼ tsp Kashmiri red chili powder  (less spicy variety, minimum ½ tsp)▢ ½ teaspoon salt, ▢ 1½ tablespoon oil or ghee▢ 2 green cardamoms▢ 1 cup onions sliced (2 medium)▢ 6 cashews▢ 4 almonds  (or substitute with cashews)▢ ¼ cup curd (plain yogurt or coconut milk), ▢ 1 to 2 tablespoon oil or ghee▢ 1 small  bay leaf (optional)▢ 4 cloves (optional)▢ 2 inch cinnamon (optional)▢ 1 cardamom (optional)▢ 1 to 2  green chilies slit or chopped (optional, Thai/Indian or serrano peppers)▢ ½ cup hot water (more if needed)▢ ¼ teaspoon salt  (adjust to taste)▢ ½ to ¾ teaspoon garam masala▢ 1½ teaspoon coriander powder (ground coriander)▢ ¼ teaspoon Kashmiri red chili powder  (optional, for color)▢ 3 tablespoons coriander leaves (cilantro) chopped",
        "Instructions": "▢ To a mixing bowl, add chicken, yogurt, ginger garlic paste, turmeric, salt, red chili powder and garam masala. ½ kg (1.2 lbs) chicken, ¼ teaspoon ground turmeric, 3 tablespoons curd, 1 tablespoon ginger garlic paste, 1 to 1¼ tsp Kashmiri red chili powder, ½ teaspoon salt▢ Mix all of them well. Cover and set aside until needed., ▢ Heat a pan with oil and add 2 cardamoms. 1½ tablespoon oil or ghee▢ Add sliced onions and fry them evenly until golden brown. Next add cashews and almonds. Cool these completely. ▢ Later add the cooled onions and nuts to a blender jar along with yogurt. Blend these to a smooth puree. You may add a splash of water to help blend it if you want. Set this aside., ▢ To the same pan, add oil and heat it.1 to 2 tablespoon oil or ghee▢ Optional – Saute whole spices – bay leaf, cinnamon stick, cloves and cardamom in oil for a min. ▢ Add green chilli and marinated chicken. Saute on a medium heat until the raw smell of ginger garlic paste goes away. This takes about 5 to 6 minutes.▢ Then add the onion nut puree. Pour hot water and mix well.½ cup hot water▢ Add salt, coriander powder and garam masala. If required you can also add more chili powder for color.▢ Mix well & raise the heat to bring to a boil. Reduce the heat. Cover and cook on a low flame until chicken is cooked to tender & you see traces of oil over the korma.▢ Cook further till the gravy reaches a desired consistency. If it is too thick then pour some hot water to bring it to consistency.▢ Garnish with coriander leaves.▢ Serve chicken korma with Jeera rice, plain Basmati Rice, Butter Naan, roti or paratha."
    },
    {
        "Title": "Chicken Madras Curry",
        "Ingredients": "▢ 1.1 lbs (½ kg) grams boneless chicken  breasts/ thighs▢ 1 tablespoon ginger garlic  grated/ crushed (½ tbsp. each)▢ 2 tablespoons coriander leaves  (handful leaves fine chopped)▢ 1½ tablespoon lemon juice▢ ½ to 1 teaspoon Kashmiri red chili powder  (omit for low heat)▢ ½ teaspoon sea salt▢ 1 tablespoon Madras curry powder▢ 1 teaspoon garam masala (more if needed), ▢ 3 tablespoons ghee  (divided or use ½ ghee & ½ oil)▢ 1 cup (100 grams) onions sliced▢ ½ inch (4 grams) ginger  (peeled and sliced)▢ 3 (7½ grams)  medium garlic cloves  sliced▢ 1¾ cups (200 grams)  tomatoes  sliced or diced tomatoes▢ ⅓ cup (35 to 50 grams)  carrots  sliced▢ ⅓ cup (35 to 50 grams)  red bell pepper  sliced (optional)▢ 1½ cups water or broth  (divided, 1 + ½ cup hot water)▢ 1  tablespoon Madras curry powder▢ ½ to 1 teaspoon Kashmiri chili powder (adjust to taste or omit for low heat)▢ ½ to 1½ tablespoon  tamarind paste  (or chutney or 1 tsp concentrate or lemon juice, adjust to taste, read notes)▢ ½ to 1 tablespoon sugar or jaggery (adjust to taste, omit to use chutney)▢ ¼ teaspoon salt  (adjust to taste)▢ ½  cup coconut milk (optional, at room temperature)",
        "Instructions": "▢ Marinate chicken with lemon juice, curry powder, chili powder (omit for low heat), garam masala, ginger garlic, coriander leaves and salt. Keep aside until the sauce is ready.▢ Pour half of the oil/ghee to a pot and saute the onion, carrots, ginger & garlic for 5 mins.▢ Add tomatoes and bell peppers. Saute for 2 to 3 mins and pour 1 cup water. Cover and cook until the veggies are fully cooked through and mushy.▢ Cool down & transfer to a blender. Blend to a smooth puree., ▢ Pour the rest of the ghee to the pan and add marinated chicken. Saute for 5 mins on a medium heat. Stir in the curry powder, salt and chili powder.▢ Transfer the onion tomato base curry sauce and mix well. Pour hot water & mix well. Cover and cook until the chicken is fork tender for another 5 to 8 mins.▢ Stir in lower amount of tamarind/ chutney, sugar & mix well (if using lemon, add at the time of serving). Taste test and add more salt, sugar, tamarind or garam masala to taste. It should be hot, spicy, slightly sweet and tangy.▢ If it is too hot, turn down the heat and pour the coconut milk. Bring it to a gentle boil and turn off. ▢ Sprinkle coriander leaves and serve hot with rice or chapati or roti."
    },
    {
        "Title": "Fish Curry Recipe",
        "Ingredients": "▢ 1.1 lbs (½ kg) Fish (any firm fish)▢ ½ tbsp ginger garlic paste▢ ⅛ tsp turmeric▢ ¼ to ½ tsp Kashmiri red chili powder▢ ¼ tsp salt  or as needed, ▢ 1 tbsp oil  (adjust as needed)▢ ½ tsp cumin seeds (jeera)▢ 2 medium  onions  sliced about 1 cup sliced▢ ½ tbsp ginger garlic minced or paste▢ 2 medium tomatoes ripe (¾ to 1 cup chopped)▢ ½ tsp salt (adjust to taste)▢ 1 tsp Kashmiri red chilli powder (adjust as needed)▢ ⅛ tsp turmeric▢ ½ tsp fennel seeds (optional) (saunf)▢ 2 tbsp coconut (grated or ¼ cup coconut milk or 12 cashew nuts), ▢ 1 tbsp oil▢ 1 sprig  curry leaves or small bay leaf▢ 1 to 2 green chili  (chopped or slit)▢ 1 to 1 ½ tsp garam masala or curry powder as needed (refer notes)▢ 1¼ to 1½ cup water",
        "Instructions": "▢ Marinate fish with ½ tbsp ginger garlic paste, ⅛ tsp turmeric, ¼ tsp red chilli powder & ¼ tsp salt. ▢ On a flat fry pan, heat 1 tsp oil. Fry fish pieces slightly until the raw smell goes away just for 2 to 3 mins on both sides. You can also sear the fish. Keep this aside. (refer picture below)▢ Heat 1 tbsp oil in a pot and add cumin. When they sputter, add onions and saute until lightly golden.▢ Next add ginger garlic paste and saute for 30 seconds. Add tomatoes & ½ tsp salt. Saute until tomatoes turn soft and mushy.▢ Next add coconut, fennel seeds (optional), red chili powder & turmeric. Fry until the mixture turns fragrant & raw smell has gone away.▢ Cool this & add to a blender jar along with 2 to 4 tbsps water. Blend to a smooth or coarse paste to suit your liking. (refer notes). You can also use a immersion blender. Keep this aside., ▢ Add 1 tbsp more oil to the same pot used earlier. Heat up on a low flame. ▢ When the oil turns slightly hot, add curry leaves & green chilies. ▢ When they splutter, add the ground onion tomato paste and garam masala. Taste test the paste and add more chilli powder at this stage if you want more heat or more deeper color.▢ Saute until the mixture smells good. ▢ Pour 1 ¼ to 1½ cup water. Mix and bring it to a boil. Cook until you see traces of oil on the surface and the gravy thickens a bit.▢ Gently slide the fish pieces and cook covered on a medium heat.▢ Carefully flip or turn the pieces to the other side after 3 to 4 mins.▢ Cook until the fish pieces bulge a bit. This is the indication they are cooked completely. Taste the curry and add more salt if needed.▢ Optionally garnish fish curry with coriander leaves if desired."
    },
    {
        "Title": "Mutton Curry | Mutton Masala Gravy",
        "Ingredients": "▢ ½ kg (1.1 lbs.) mutton (bone-in or boneless lamb/goat, cut to 1½ to 2 inch)▢ 2 tablespoons plain yogurt (curd)▢ ¾ tablespoon ginger garlic paste▢ ¾ teaspoon salt  (use as needed)▢ ¼ teaspoon turmeric▢ 1 teaspoon meat masala (or garam masala)▢ ½ teaspoon Kashmiri red chili powder (adjust to heat preference, leave out for low heat), ▢ 2 tablespoons oil▢ 3 green cardamoms /elaichi▢ 1 inch cinnamon  ▢ 1 cup onions fine chopped or processed ▢ ¾ cup (1 large) tomatoes pureed or chopped▢ 1 to 2 green chilies slit or chopped (optional, leave out for low heat)▢ 2  teaspoons meat masala or garam masala ( I use Everest meat masala)▢ 2 sprigs curry leaves or 1 bay leaf (optional)▢ ½ teaspoon salt  or as needed, to adjust later ▢ 1 to 2 tablespoons coriander leaves  /cilantro chopped to garnish, ▢ ¾  cup hot water to cook in stovetop pressure cooker▢ 2 to 2½  cups hot water to cook in a regular pot/Dutch oven",
        "Instructions": "▢ Marinate mutton with salt, ginger garlic, turmeric, garam masala or meat masala, chili powder and curd. Yogurt & ginger garlic paste are natural meat tenderizers so they make the mutton succulent.▢ Set aside until you prepare the rest or leave it in the refrigerator to marinate overnight. (When you are ready to cook, leave the cold mutton out on the counter for 30 mins to bring the meat closer to room temperature.), ▢ On a low to medium flame, gently heat oil in a pan or pressure cooker. Add the whole spices – cinnamon, cardamoms and bay leaf (optional), followed by onions & green chilies.▢ Saute until onions turn golden. Lower the flame to very low as much as possible.  Then transfer the marinated mutton and saute for 5 to 7 mins.▢ Stir in the meat masala & curry leaves (optional), followed by pureed tomatoes.▢ Increase the heat to medium and saute for another 5 to 7 mins, until the raw flavor of tomatoes has reduced. Pour hot water & mix well.▢ To cook in a regular pot: Bring it to a gentle boil and cook covered on a medium heat for 1 hour 30 minutes. Stir well every 12 to 15 minutes and pour more hot water in batches as needed.▢ Stovetop Pressure Cooker: Pressure cook on a medium heat for 4 to 5 whistles, depending on the kind or cooker, meat and size of the mutton pieces. ▢ When the pressure drops, open the lid and mix well. If the curry is runny, cook/saute for a few more minutes to evaporate some of the moisture. Your mutton is cooked through when it is tender, flakes easily with a fork and falls off the bone easily. ▢ Taste the curry and add more salt if needed. If you feel it is low on flavor, you may sprinkle little garam masala. Garnish with fine chopped coriander leaves.▢ Serve mutton curry hot with rice, tandoori roti, naan or plain paratha."
    }
]